/*************配置************/
function declareConfig() {
	BarrierFreeConfig = new Object();
	//定义网页body里面最外层DIV ID
	BarrierFreeConfig.mainBox = "barrierfree_container";

	//无障碍操作说明链接地址
	var pathname = window.location.pathname;
	if (!Array.prototype.indexOf)
	{
	  Array.prototype.indexOf = function(elt /*, from*/)
	  {
	    var len = this.length >>> 0;
	    var from = Number(arguments[1]) || 0;
	    from = (from < 0)
	         ? Math.ceil(from)
	         : Math.floor(from);
	    if (from < 0)
	      from += len;
	    for (; from < len; from++)
	    {
	      if (from in this &&
	          this[from] === elt)
	        return from;
	    }
	    return -1;
	  };
	}
	if(pathname.indexOf("/view/")!=-1){
		path = pathname.substr(0,pathname.indexOf("/web")) + "/module/jslib/accessiblereading/wza_help.html";
//		if(pathname.indexOf("col")!=-1){
//			path = "../../../module/accessiblereading/wza_help.html";
//		}else if(pathname.indexOf("art")!=-1){
//			path = "../../../../../module/accessiblereading/wza_help.html";
//		}else{
//			path = "../module/accessiblereading/wza_help.html";
//		}
	}else{
		path = "/module/jslib/accessiblereading/wza_help.html";
//		if(pathname.indexOf("col")!=-1){
//			path = "../../module/accessiblereading/wza_help.html";
//		}else if(pathname.indexOf("art")!=-1){
//			path = "../../../../module/accessiblereading/wza_help.html";
//		}else{
//			path = "module/accessiblereading/wza_help.html";
//		}
	}
	BarrierFreeConfig.barrierfreeHelp = path;

	// 以下是网页区域标识，快捷键导航时使用
	// 无障碍操作说明ID
	BarrierFreeConfig.AccessHelp = 'accesshelp';
	BarrierFreeConfig.AccessHelpTitle = "已定位到无障碍帮助";

	//主导航区ID
	BarrierFreeConfig.MainNavigation = 'mainNav';
	BarrierFreeConfig.MainNavigationTitle = "已定位到网站导航";

	//服务引导区
	BarrierFreeConfig.HeaderGuide = 'headerGuideNav';
	BarrierFreeConfig.HeaderGuideTitle = "已跳转到网站服务引导区";

	//主要内容区ID
	BarrierFreeConfig.MainContent = 'main';
	BarrierFreeConfig.MainContentTitle = "已跳转到主要内容区";

	//网站地图区ID
	BarrierFreeConfig.SiteMap = 'copyright';
	BarrierFreeConfig.SiteMapTitle = "已跳转到网站地图区";

	//搜索区ID
	BarrierFreeConfig.SearchForm = 'search';
	BarrierFreeConfig.SearchFormTitle = "已跳转到搜索区域";

	//头部内容区ID
	BarrierFreeConfig.HeadContent = 'header';
	BarrierFreeConfig.HeadContentTitle = "已跳转到头部内容区域";

	//底部内容区ID
	BarrierFreeConfig.BottomContent = 'footer';
	BarrierFreeConfig.BottomContentTitle = "已跳转到底部内容区域";

	//网页左栏区ID
	BarrierFreeConfig.LeftContent = 'leftSidebar';
	BarrierFreeConfig.LeftContentTitle = "已跳转网页左栏区域";

	//网页中间区ID
	BarrierFreeConfig.MiddleContent = 'leftbox';
	BarrierFreeConfig.MiddleContentTitle = "已跳转到中间结构区域";

	//网页右栏区ID
	BarrierFreeConfig.RightContent = 'rightSidebar';
	BarrierFreeConfig.RightContentTitle = "已跳转到网页右栏区域";

	//栏目分组标记 H2 或 H3 或 H4
	BarrierFreeConfig.GroupTagNameH2 = 'H2';
	BarrierFreeConfig.GroupTagNameH3 = 'H3';
	BarrierFreeConfig.GroupTagNameH4 = 'H4';

	//图文模式工具样式
	BarrierFreeConfig.HtmlToolCssUrl = 'barrierfree.css';
	//文本模式工具样式
	//BarrierFreeConfig.TextToolCssUrl = serverUrl + 'barrierfree_tool_style.css';

	//文本模式页面样式
	if(pathname.indexOf("/view/")!=-1){
		path = pathname.substr(0,pathname.indexOf("/web")) + "/module/jslib/accessiblereading/css/barrierfree_style.css";
	}else{
		path = "/module/jslib/accessiblereading/css/barrierfree_style.css";
	}
	BarrierFreeConfig.TextModeCssUrl = path;
}


/*****************拼音**********************/
pinyin={"1":"yī","2":"èr","3":"sān","4":"sì","5":"wǔ","6":"liù","7":"qī","8":"bā","9":"jiǔ","0":"líng","啊":"ā","阿":"ā","埃":"āi","挨":"āi","哎":"āi","唉":"āi","哀":"āi","皑":"ái","癌":"ái","蔼":"ǎi","矮":"ǎi","艾":"ài","碍":"ài","爱":"ài","隘":"ài","鞍":"ān","氨":"ān","安":"ān","俺":"ǎn","按":"àn","暗":"àn","岸":"àn","胺":"àn","案":"àn","肮":"āng","昂":"áng","盎":"àng","凹":"āo","敖":"áo","熬":"áo","翱":"áo","袄":"ǎo","傲":"ào","奥":"ào","懊":"ào","澳":"ào","芭":"bā","捌":"bā","扒":"bā","叭":"bā","吧":"bā","笆":"bā","八":"bā","疤":"bā","巴":"bā","拔":"bá","跋":"bá","靶":"bǎ","把":"bǎ","耙":"pá","坝":"bà","霸":"bà","罢":"bà","爸":"bà","白":"bái","柏":"bǎi","百":"bǎi","摆":"bǎi","佰":"bǎi","败":"bài","拜":"bài","稗":"bài","斑":"bān","班":"bān","搬":"bān","扳":"bān","般":"bān","颁":"bān","板":"bǎn","版":"bǎn","扮":"bàn","拌":"bàn","伴":"bàn","瓣":"bàn","半":"bàn","办":"bàn","绊":"bàn","邦":"bāng","帮":"bāng","梆":"bāng","榜":"bǎng","膀":"bǎng","绑":"bǎng","棒":"bàng","磅":"páng","蚌":"bàng","镑":"bàng","傍":"bàng","谤":"bàng","苞":"bāo","胞":"bāo","包":"bāo","褒":"bāo","剥":"bāo","薄":"báo","雹":"báo","保":"bǎo","堡":"bǎo","饱":"bǎo","宝":"bǎo","抱":"bào","报":"bào","暴":"bào","豹":"bào","鲍":"bào","爆":"bào","杯":"bēi","碑":"bēi","悲":"bēi","卑":"bēi","北":"běi","辈":"bèi","背":"bèi","贝":"bèi","钡":"bèi","倍":"bèi","狈":"bèi","备":"bèi","惫":"bèi","焙":"bèi","被":"bèi","奔":"bēn","苯":"běn","本":"běn","笨":"bèn","崩":"bēng","绷":"bēng","甭":"béng","泵":"bèng","蹦":"bèng","迸":"bèng","逼":"bī","鼻":"bí","比":"bǐ","鄙":"bǐ","笔":"bǐ","彼":"bǐ","碧":"bì","蓖":"bì","蔽":"bì","毕":"bì","毙":"bì","毖":"bì","币":"bì","庇":"bì","痹":"bì","闭":"bì","敝":"bì","弊":"bì","必":"bì","辟":"pì","壁":"bì","臂":"bì","避":"bì","陛":"bì","鞭":"biān","边":"biān","编":"biān","贬":"biǎn","扁":"biǎn","便":"biàn","变":"biàn","卞":"biàn","辨":"biàn","辩":"biàn","辫":"biàn","遍":"biàn","标":"biāo","彪":"biāo","膘":"biāo","表":"biǎo","鳖":"biē","憋":"biē","别":"bié","瘪":"biě","彬":"bīn","斌":"bīn","濒":"bīn","滨":"bīn","宾":"bīn","摈":"bìn","兵":"bīng","冰":"bīng","柄":"bǐng","丙":"bǐng","秉":"bǐng","饼":"bǐng","炳":"bǐng","病":"bìng","并":"bìng","玻":"bō","菠":"bō","播":"bō","拨":"bō","钵":"bō","波":"bō","博":"bó","勃":"bó","搏":"bó","铂":"bó","箔":"bó","伯":"bó","帛":"bó","舶":"bó","脖":"bó","膊":"bó","渤":"bó","泊":"bó","驳":"bó","捕":"bǔ","卜":"bo","哺":"bǔ","补":"bǔ","埠":"bù","不":"bù","布":"bù","步":"bù","簿":"bù","部":"bù","怖":"bù","擦":"cā","猜":"cāi","裁":"cái","材":"cái","才":"cái","财":"cái","睬":"cǎi","踩":"cǎi","采":"cǎi","彩":"cǎi","菜":"cài","蔡":"cài","餐":"cān","参":"cān","蚕":"cán","残":"cán","惭":"cán","惨":"cǎn","灿":"càn","苍":"cāng","舱":"cāng","仓":"cāng","沧":"cāng","藏":"cáng","操":"cāo","糙":"cāo","槽":"cáo","曹":"cáo","草":"cǎo","厕":"cè","策":"cè","侧":"cè","册":"cè","测":"cè","层":"céng","蹭":"cèng","插":"chā","叉":"chā","茬":"chá","茶":"chá","查":"chá","碴":"chá","搽":"chá","察":"chá","岔":"chà","差":"chà","诧":"chà","拆":"chāi","柴":"chái","豺":"chái","搀":"chān","掺":"chān","蝉":"chán","馋":"chán","谗":"chán","缠":"chán","铲":"chǎn","产":"chǎn","阐":"chǎn","颤":"chàn","昌":"chāng","猖":"chāng","场":"chǎng","尝":"cháng","常":"cháng","长":"cháng","偿":"cháng","肠":"cháng","厂":"chǎng","敞":"chǎng","畅":"chàng","唱":"chàng","倡":"chàng","超":"chāo","抄":"chāo","钞":"chāo","朝":"cháo","嘲":"cháo","潮":"cháo","巢":"cháo","吵":"chǎo","炒":"chǎo","车":"chē","扯":"chě","撤":"chè","掣":"chè","彻":"chè","澈":"chè","郴":"chēn","臣":"chén","辰":"chén","尘":"chén","晨":"chén","忱":"chén","沉":"chén","陈":"chén","趁":"chèn","衬":"chèn","撑":"chēng","称":"chēng","城":"chéng","橙":"chéng","成":"chéng","呈":"chéng","乘":"chéng","程":"chéng","惩":"chéng","澄":"chéng","诚":"chéng","承":"chéng","逞":"chěng","骋":"chěng","秤":"chèng","吃":"chī","痴":"chī","持":"chí","匙":"chí","池":"shi","迟":"chí","弛":"chí","驰":"chí","耻":"chǐ","齿":"chǐ","侈":"chǐ","尺":"chǐ","赤":"chì","翅":"chì","斥":"chì","炽":"chì","充":"chōng","冲":"chōng","虫":"chóng","崇":"chóng","宠":"chǒng","抽":"chōu","酬":"chóu","畴":"chóu","踌":"chóu","稠":"chóu","愁":"chóu","筹":"chóu","仇":"chóu","绸":"chóu","瞅":"chǒu","丑":"chǒu","臭":"chòu","初":"chū","出":"chū","橱":"chú","厨":"chú","躇":"chú","锄":"chú","雏":"chú","滁":"chú","除":"chú","楚":"chǔ","础":"chǔ","储":"chǔ","矗":"chù","搐":"chù","触":"chù","处":"chǔ","揣":"chuāi","川":"chuān","穿":"chuān","椽":"chuán","传":"chuán","船":"chuán","喘":"chuǎn","串":"chuàn","疮":"chuāng","窗":"chuāng","幢":"zhuàng","床":"chuáng","闯":"chuǎng","创":"chuàng","吹":"chuí","炊":"chuī","捶":"chuī","锤":"chuí","垂":"chuí","春":"chūn","椿":"chūn","醇":"chún","唇":"chún","淳":"chún","纯":"chún","蠢":"chǔn","戳":"chuō","绰":"chuō","疵":"cī","茨":"cí","磁":"cí","雌":"cí","辞":"cí","慈":"cí","瓷":"cí","词":"cí","此":"cǐ","刺":"cì","赐":"cì","次":"cì","聪":"cōng","葱":"cōng","囱":"cōng","匆":"cōng","从":"cóng","丛":"cóng","凑":"còu","粗":"cū","醋":"cù","簇":"cù","促":"cù","蹿":"cuān","篡":"cuàn","窜":"cuàn","摧":"cuī","崔":"cuī","催":"cuī","脆":"cuì","瘁":"cuì","粹":"cuì","淬":"cuì","翠":"cuì","村":"cūn","存":"cún","寸":"cùn","磋":"cuō","撮":"cuō","搓":"cuō","措":"cuò","挫":"cuò","错":"cuò","搭":"dā","达":"dá","答":"dá","瘩":"dá","打":"dǎ","大":"dà","呆":"dāi","歹":"dǎi","傣":"dǎi","戴":"dài","带":"dài","殆":"dài","代":"dài","贷":"dài","袋":"dài","待":"dài","逮":"dǎi","怠":"dài","耽":"dān","担":"dān","丹":"dān","单":"dān","郸":"dān","掸":"dǎn","胆":"dǎn","旦":"dàn","氮":"dàn","但":"dàn","惮":"dàn","淡":"dàn","诞":"dàn","弹":"dàn","蛋":"dàn","当":"dāng","挡":"dǎng","党":"dǎng","荡":"dàng","档":"dàng","刀":"dāo","捣":"dǎo","蹈":"dǎo","倒":"dǎo","岛":"dǎo","祷":"dǎo","导":"dǎo","到":"dào","稻":"dào","悼":"dào","道":"dào","盗":"dào","德":"dé","得":"dé","的":"de","蹬":"dēng","灯":"dēng","登":"dēng","等":"děng","瞪":"dèng","凳":"dèng","邓":"dèng","堤":"dī","低":"dī","滴":"dī","迪":"dī","敌":"dí","笛":"dí","狄":"dí","涤":"dí","翟":"dí","嫡":"dí","抵":"dǐ","底":"dǐ","地":"dì","蒂":"dì","第":"dì","帝":"dì","弟":"dì","递":"dì","缔":"dì","颠":"diān","掂":"diān","滇":"diān","碘":"diǎn","点":"diǎn","典":"diǎn","靛":"diàn","垫":"diàn","电":"diàn","佃":"diàn","甸":"diàn","店":"diàn","惦":"diàn","奠":"diàn","淀":"diàn","殿":"diàn","碉":"diāo","叼":"diāo","雕":"diāo","凋":"diāo","刁":"diāo","掉":"diào","吊":"diào","钓":"diào","调":"diào","跌":"diē","爹":"diē","碟":"dié","蝶":"dié","迭":"dié","谍":"dié","叠":"dié","丁":"dīng","盯":"dīng","叮":"dīng","钉":"dìng","顶":"dǐng","鼎":"dǐng","锭":"dìng","定":"dìng","订":"dìng","丢":"diu1","东":"dōng","冬":"dōng","董":"dǒng","懂":"dǒng","动":"dòng","栋":"dòng","侗":"dòng","恫":"dòng","冻":"dòng","洞":"dòng","兜":"dōu","抖":"dǒu","斗":"dòu","陡":"dǒu","豆":"dòu","逗":"dòu","痘":"dòu","都":"dōu","督":"dū","毒":"dú","犊":"dú","独":"dú","读":"dú","堵":"dǔ","睹":"dǔ","赌":"dǔ","杜":"dù","镀":"dù","肚":"dù","度":"dù","渡":"dù","妒":"dù","端":"duān","短":"duǎn","锻":"duàn","段":"duàn","断":"duàn","缎":"duàn","堆":"duī","兑":"duì","队":"duì","对":"duì","墩":"dūn","吨":"dūn","蹲":"dūn","敦":"dūn","顿":"dùn","囤":"dùn","钝":"dùn","盾":"dùn","遁":"dùn","掇":"duō","哆":"duō","多":"duō","夺":"duó","垛":"duǒ","躲":"duǒ","朵":"duǒ","跺":"duò","舵":"duò","剁":"duò","惰":"duò","堕":"duò","蛾":"é","峨":"é","鹅":"é","俄":"é","额":"é","讹":"é","娥":"é","恶":"è","厄":"è","扼":"è","遏":"è","鄂":"è","饿":"è","恩":"ēn","而":"ér","儿":"ér","耳":"ěr","尔":"ěr","饵":"ěr","洱":"ěr","二":"èr","贰":"èr","发":"fā","罚":"fá","筏":"fá","伐":"fá","乏":"fá","阀":"fá","法":"fǎ","珐":"fà","藩":"fān","帆":"fān","番":"fān","翻":"fān","樊":"fán","矾":"fán","钒":"fán","繁":"fán","凡":"fán","烦":"fán","反":"fǎn","返":"fǎn","范":"fàn","贩":"fàn","犯":"fàn","饭":"fàn","泛":"fàn","坊":"fāng","芳":"fāng","方":"fāng","肪":"fáng","房":"fáng","防":"fáng","妨":"fáng","仿":"fǎng","访":"fǎng","纺":"fǎng","放":"fàng","菲":"fēi","非":"fēi","啡":"fēi","飞":"fēi","肥":"féi","匪":"fěi","诽":"fěi","吠":"fèi","肺":"fèi","废":"fèi","沸":"fèi","费":"fèi","芬":"fēn","酚":"fēn","吩":"fēn","氛":"fēn","分":"fēn","纷":"fēn","坟":"fén","焚":"fén","汾":"fén","粉":"fěn","奋":"fèn","份":"fèn","忿":"fèn","愤":"fèn","粪":"fèn","丰":"fēng","封":"fēng","枫":"fēng","蜂":"fēng","峰":"fēng","锋":"fēng","风":"fēng","疯":"fēng","烽":"fēng","逢":"féng","冯":"féng","缝":"féng","讽":"fěng","奉":"fèng","凤":"fèng","佛":"fó","否":"fǒu","夫":"fū","敷":"fū","肤":"fū","孵":"fū","扶":"fú","拂":"fú","辐":"fú","幅":"fú","氟":"fú","符":"fú","伏":"fú","俘":"fú","服":"fú","浮":"fú","涪":"fú","福":"fú","袱":"fú","弗":"fú","甫":"fǔ","抚":"fǔ","辅":"fǔ","俯":"fǔ","釜":"fǔ","斧":"fǔ","脯":"pú","腑":"fǔ","府":"fǔ","腐":"fǔ","赴":"fù","副":"fù","覆":"fù","赋":"fù","复":"fù","傅":"fù","付":"fù","阜":"fù","父":"fù","腹":"fù","负":"fù","富":"fù","讣":"fù","附":"fù","妇":"fù","缚":"fù","咐":"fù","噶":"gá","嘎":"gā","该":"gāi","改":"gǎi","概":"gài","钙":"gài","盖":"gài","溉":"gài","干":"gàn","甘":"gān","杆":"gǎn","柑":"gān","竿":"gān","肝":"gān","赶":"gǎn","感":"gǎn","秆":"gǎn","敢":"gǎn","赣":"gàn","冈":"gāng","刚":"gāng","钢":"gāng","缸":"gāng","肛":"gāng","纲":"gāng","岗":"gǎng","港":"gǎng","杠":"gàng","篙":"gāo","皋":"gāo","高":"gāo","膏":"gāo","羔":"gāo","糕":"gāo","搞":"gǎo","镐":"gǎo","稿":"gǎo","告":"gào","哥":"gē","歌":"gē","搁":"gē","戈":"gē","鸽":"gē","胳":"gē","疙":"gē","割":"gē","革":"gé","葛":"gě","格":"gé","蛤":"há","阁":"gé","隔":"gé","铬":"gè","个":"gè","各":"gè","给":"gěi","根":"gēn","跟":"gēn","耕":"gēng","更":"gèng","庚":"gēng","羹":"gēng","埂":"gěng","耿":"gěng","梗":"gěng","工":"gōng","攻":"gōng","功":"gōng","恭":"gōng","龚":"gōng","供":"gòng","躬":"gōng","公":"gōng","宫":"gōng","弓":"gōng","巩":"gǒng","汞":"gǒng","拱":"gǒng","贡":"gòng","共":"gòng","钩":"gōu","勾":"gōu","沟":"gōu","苟":"gǒu","狗":"gǒu","垢":"gòu","构":"gòu","购":"gòu","够":"gòu","辜":"gū","菇":"gū","咕":"gū","箍":"gū","估":"gū","沽":"gū","孤":"gū","姑":"gū","鼓":"gǔ","古":"gǔ","蛊":"gǔ","骨":"gǔ","谷":"gǔ","股":"gǔ","故":"gù","顾":"gù","固":"gù","雇":"gù","刮":"guā","瓜":"guā","剐":"guǎ","寡":"guǎ","挂":"guà","褂":"guà","乖":"guāi","拐":"guǎi","怪":"guài","棺":"guān","关":"guān","官":"guān","冠":"guàn","观":"guān","管":"guǎn","馆":"guǎn","罐":"guàn","惯":"guàn","灌":"guàn","贯":"guàn","光":"guāng","广":"guǎng","逛":"guàng","瑰":"guī","规":"guī","圭":"guī","硅":"guī","归":"guī","龟":"guī","闺":"guī","轨":"guǐ","鬼":"guǐ","诡":"guǐ","癸":"guǐ","桂":"guì","柜":"guì","跪":"guì","贵":"guì","刽":"guì","辊":"gǔn","滚":"gǔn","棍":"gùn","锅":"guō","郭":"guō","国":"guó","果":"guǒ","裹":"guǒ","过":"guò","哈":"hā","骸":"hái","孩":"hái","海":"hǎi","氦":"hài","亥":"hài","害":"hài","骇":"hài","酣":"hān","憨":"hān","邯":"hán","韩":"hán","含":"hán","涵":"hán","寒":"hán","函":"hán","喊":"hǎn","罕":"hǎn","翰":"hàn","撼":"hàn","捍":"hàn","旱":"hàn","憾":"hàn","悍":"hàn","焊":"hàn","汗":"hàn","汉":"hàn","夯":"hāng","杭":"háng","航":"háng","壕":"háo","嚎":"háo","豪":"háo","毫":"háo","郝":"hǎo","好":"hǎo","耗":"hào","号":"hào","浩":"hào","呵":"hē","喝":"hē","荷":"hé","菏":"hé","核":"hé","禾":"hé","和":"hé","何":"hé","合":"hé","盒":"hé","貉":"hè","阂":"hé","河":"hé","涸":"hé","赫":"hè","褐":"hè","鹤":"hè","贺":"hè","嘿":"hēi","黑":"hēi","痕":"hén","很":"hěn","狠":"hěn","恨":"hèn","哼":"hēng","亨":"hēng","横":"héng","衡":"héng","恒":"héng","轰":"hōng","哄":"hǒng","烘":"hōng","虹":"hóng","鸿":"hóng","洪":"hóng","宏":"hóng","弘":"hóng","红":"hóng","喉":"hóu","侯":"hòu","猴":"hóu","吼":"hǒu","厚":"hòu","候":"hòu","后":"hòu","呼":"hū","乎":"hū","忽":"hū","瑚":"hú","壶":"hú","葫":"hú","胡":"hú","蝴":"hú","狐":"hú","糊":"hú","湖":"hú","弧":"hú","虎":"hǔ","唬":"hǔ","护":"hù","互":"hù","沪":"hù","户":"hù","花":"huā","哗":"huá","华":"huá","猾":"huá","滑":"huá","画":"huà","划":"huá","化":"huà","话":"huà","槐":"huái","徊":"huái","怀":"huái","淮":"huái","坏":"huài","欢":"huān","环":"huán","桓":"huán","还":"hái","缓":"huǎn","换":"huàn","患":"huàn","唤":"huàn","痪":"huàn","豢":"huàn","焕":"huàn","涣":"huàn","宦":"huàn","幻":"huàn","荒":"huāng","慌":"huāng","黄":"huáng","磺":"huáng","蝗":"huáng","簧":"huáng","皇":"huáng","凰":"huáng","惶":"huáng","煌":"huáng","晃":"huàng","幌":"huǎng","恍":"huǎng","谎":"huǎng","灰":"huī","挥":"huī","辉":"huī","徽":"huī","恢":"huī","蛔":"huí","回":"huí","毁":"huǐ","悔":"huǐ","慧":"huì","卉":"huì","惠":"huì","晦":"huì","贿":"huì","秽":"huì","会":"huì","烩":"huì","汇":"huì","讳":"huì","诲":"huì","绘":"huì","荤":"hūn","昏":"hūn","婚":"hūn","魂":"hún","浑":"hún","混":"hùn","豁":"huō","活":"huó","伙":"huǒ","火":"huǒ","获":"huò","或":"huò","惑":"huò","霍":"huò","货":"huò","祸":"huò","击":"jī","圾":"jī","基":"jī","机":"jī","畸":"jī","稽":"jī","积":"jī","箕":"jī","肌":"jī","饥":"jī","迹":"jì","激":"jī","讥":"jī","鸡":"jī","姬":"jī","绩":"jì","缉":"jī","吉":"jí","极":"jí","棘":"jí","辑":"jí","籍":"jí","集":"jí","及":"jí","急":"jí","疾":"jí","汲":"jí","即":"jí","嫉":"jí","级":"jí","挤":"jǐ","几":"jǐ","脊":"jǐ","己":"jǐ","蓟":"jì","技":"jì","冀":"jì","季":"jì","伎":"jì","祭":"jì","剂":"jì","悸":"jì","济":"jì","寄":"jì","寂":"jì","计":"jì","记":"jì","既":"jì","忌":"jì","际":"jì","妓":"jì","继":"jì","纪":"jì","嘉":"jiā","枷":"jiā","夹":"jiā","佳":"jiā","家":"jiā","加":"jiā","荚":"jiá","颊":"jiá","贾":"jiǎ","甲":"jiǎ","钾":"jiǎ","假":"jiǎ","稼":"jià","价":"jià","架":"jià","驾":"jià","嫁":"jià","歼":"jiān","监":"jiān","坚":"jiān","尖":"jiān","笺":"jiān","间":"jiān","煎":"jiān","兼":"jiān","肩":"jiān","艰":"jiān","奸":"jiān","缄":"jiān","茧":"jiǎn","检":"jiǎn","柬":"jiǎn","碱":"jiǎn","硷":"jiǎn","拣":"jiǎn","捡":"jiǎn","简":"jiǎn","俭":"jiǎn","剪":"jiǎn","减":"jiǎn","荐":"jiàn","槛":"kǎn","鉴":"jiàn","践":"jiàn","贱":"jiàn","见":"jiàn","键":"jiàn","箭":"jiàn","件":"jiàn","健":"jiàn","舰":"jiàn","剑":"jiàn","饯":"jiàn","渐":"jiàn","溅":"jiàn","涧":"jiàn","建":"jiàn","僵":"jiāng","姜":"jiāng","将":"jiāng","浆":"jiāng","江":"jiāng","疆":"jiāng","蒋":"jiǎng","桨":"jiǎng","奖":"jiǎng","讲":"jiǎng","匠":"jiàng","酱":"jiàng","降":"jiàng","蕉":"jiāo","椒":"jiāo","礁":"jiāo","焦":"jiāo","胶":"jiāo","交":"jiāo","郊":"jiāo","浇":"jiāo","骄":"jiāo","娇":"jiāo","嚼":"jiáo","搅":"jiǎo","铰":"jiǎo","矫":"jiǎo","侥":"yáo","脚":"jiǎo","狡":"jiǎo","角":"jiǎo","饺":"jiǎo","缴":"jiǎo","绞":"jiǎo","剿":"jiǎo","教":"jiào","酵":"jiào","轿":"jiào","较":"jiào","叫":"jiào","窖":"jiào","揭":"jiē","接":"jiē","皆":"jiē","秸":"jiē","街":"jiē","阶":"jiē","截":"jié","劫":"jié","节":"jié","桔":"jú","杰":"jié","捷":"jié","睫":"jié","竭":"jié","洁":"jié","结":"jié","解":"jiě","姐":"jiě","戒":"jiè","藉":"jiè","芥":"jiè","界":"jiè","借":"jiè","介":"jiè","疥":"jiè","诫":"jiè","届":"jiè","巾":"jīn","筋":"jīn","斤":"jīn","金":"jīn","今":"jīn","津":"jīn","襟":"jīn","紧":"jǐn","锦":"jǐn","仅":"jǐn","谨":"jǐn","进":"jìn","靳":"jìn","晋":"jìn","禁":"jìn","近":"jìn","烬":"jìn","浸":"jìn","尽":"jìn","劲":"jìn","荆":"jīng","兢":"jīng","茎":"jīng","睛":"jīng","晶":"jīng","鲸":"jīng","京":"jīng","惊":"jīng","精":"jīng","粳":"jīng","经":"jīng","井":"jǐng","警":"jǐng","景":"jǐng","颈":"jǐng","静":"jìng","境":"jìng","敬":"jìng","镜":"jìng","径":"jìng","痉":"jìng","靖":"jìng","竟":"jìng","竞":"jìng","净":"jìng","炯":"jiǒng","窘":"jiǒng","揪":"jiū","究":"jiū","纠":"jiū","玖":"jiǔ","韭":"jiǔ","久":"jiǔ","灸":"jiǔ","九":"jiǔ","酒":"jiǔ","厩":"jiù","救":"jiù","旧":"jiù","臼":"jiù","舅":"jiù","咎":"jiù","就":"jiù","疚":"jiù","鞠":"jū","拘":"jū","狙":"jū","疽":"jū","居":"jū","驹":"jū","菊":"jú","局":"jú","咀":"jǔ","矩":"jǔ","举":"jǔ","沮":"jǔ","聚":"jù","拒":"jù","据":"jù","巨":"jù","具":"jù","距":"jù","踞":"jù","锯":"jù","俱":"jù","句":"jù","惧":"jù","炬":"jù","剧":"jù","捐":"juān","鹃":"juān","娟":"juān","倦":"juàn","眷":"juàn","卷":"juàn","绢":"juàn","撅":"juē","攫":"jué","抉":"jué","掘":"jué","倔":"juè","爵":"jué","觉":"jué","决":"jué","诀":"jué","绝":"jué","均":"jūn","菌":"jūn","钧":"jūn","军":"jūn","君":"jūn","峻":"jùn","俊":"jùn","竣":"jùn","浚":"xùn","郡":"jùn","骏":"jùn","喀":"kā","咖":"kā","卡":"kǎ","咯":"gē","开":"kāi","揩":"kāi","楷":"kǎi","凯":"kǎi","慨":"kǎi","刊":"kān","堪":"kān","勘":"kān","坎":"kǎn","砍":"kǎn","看":"kàn","康":"kāng","慷":"kāng","糠":"kāng","扛":"káng","抗":"kàng","亢":"kàng","炕":"kàng","考":"kǎo","拷":"kǎo","烤":"kǎo","靠":"kào","坷":"kě","苛":"kē","柯":"kē","棵":"kē","磕":"kē","颗":"kē","科":"kē","壳":"ké","咳":"ké","可":"kě","渴":"kě","克":"kè","刻":"kè","客":"kè","课":"kè","肯":"kěn","啃":"kěn","垦":"kěn","恳":"kěn","坑":"kēng","吭":"kēng","空":"kōng","恐":"kǒng","孔":"kǒng","控":"kòng","抠":"kōu","口":"kǒu","扣":"kòu","寇":"kòu","枯":"kū","哭":"kū","窟":"kū","苦":"kǔ","酷":"kù","库":"kù","裤":"kù","夸":"kuā","垮":"kuǎ","挎":"kuà","跨":"kuà","胯":"kuà","块":"kuài","筷":"kuài","侩":"kuài","快":"kuài","宽":"kuān","款":"kuǎn","匡":"kuāng","筐":"kuāng","狂":"kuáng","框":"kuàng","矿":"kuàng","眶":"kuàng","旷":"kuàng","况":"kuàng","亏":"kuī","盔":"kuī","岿":"kuī","窥":"kuī","葵":"kuí","奎":"kuí","魁":"kuí","傀":"guī","馈":"kuì","愧":"kuì","溃":"kuì","坤":"kūn","昆":"kūn","捆":"kǔn","困":"kùn","括":"kuò","扩":"kuò","廓":"kuò","阔":"kuò","垃":"lā","拉":"lā","喇":"lǎ","蜡":"là","腊":"là","辣":"là","啦":"lā","莱":"lái","来":"lái","赖":"lài","蓝":"lán","婪":"lán","栏":"lán","拦":"lán","篮":"lán","阑":"lán","兰":"lán","澜":"lán","谰":"lán","揽":"lǎn","览":"lǎn","懒":"lǎn","缆":"lǎn","烂":"làn","滥":"làn","琅":"láng","榔":"láng","狼":"láng","廊":"láng","郎":"láng","朗":"lǎng","浪":"làng","捞":"lāo","劳":"láo","牢":"láo","老":"lǎo","佬":"lǎo","姥":"lǎo","酪":"lào","烙":"lào","涝":"lào","勒":"lè","乐":"lè","雷":"léi","镭":"léi","蕾":"lěi","磊":"lěi","累":"lèi","儡":"lěi","垒":"lěi","擂":"lèi","肋":"lèi","类":"lèi","泪":"lèi","棱":"léng","楞":"léng","冷":"lěng","厘":"lí","梨":"lí","犁":"lí","黎":"lí","篱":"lí","狸":"lí","离":"lí","漓":"lí","理":"lǐ","李":"lǐ","里":"lǐ","鲤":"lǐ","礼":"lǐ","莉":"lì","荔":"lì","吏":"lì","栗":"lì","丽":"lì","厉":"lì","励":"lì","砾":"lì","历":"lì","利":"lì","傈":"lì","例":"lì","俐":"lì","痢":"lì","立":"lì","粒":"lì","沥":"lì","隶":"lì","力":"lì","璃":"lí","哩":"lǐ","俩":"liǎng","联":"lián","莲":"lián","连":"lián","镰":"lián","廉":"lián","怜":"lián","涟":"lián","帘":"lián","敛":"liǎn","脸":"liǎn","链":"liàn","恋":"liàn","炼":"liàn","练":"liàn","粮":"liáng","凉":"liáng","梁":"liáng","粱":"liáng","良":"liáng","两":"liǎng","辆":"liàng","量":"liàng","晾":"liàng","亮":"liàng","谅":"liàng","撩":"liáo","聊":"liáo","僚":"liáo","疗":"liáo","燎":"liáo","寥":"liáo","辽":"liáo","潦":"liáo","了":"le","撂":"liào","镣":"liào","廖":"liào","料":"liào","列":"liè","裂":"liè","烈":"liè","劣":"liè","猎":"liè","琳":"lín","林":"lín","磷":"lín","霖":"lín","临":"lín","邻":"lín","鳞":"lín","淋":"lín","凛":"lǐn","赁":"lìn","吝":"lìn","拎":"līn","玲":"líng","菱":"líng","零":"líng","龄":"líng","铃":"líng","伶":"líng","羚":"líng","凌":"líng","灵":"líng","陵":"líng","岭":"lǐng","领":"lǐng","另":"lìng","令":"lìng","溜":"liū","琉":"liú","榴":"liú","硫":"liú","馏":"liú","留":"liú","刘":"liú","瘤":"liú","流":"liú","柳":"liǔ","六":"liù","龙":"lóng","聋":"lóng","咙":"lóng","笼":"lóng","窿":"lóng","隆":"lóng","垄":"lǒng","拢":"lǒng","陇":"lǒng","楼":"lóu","娄":"lóu","搂":"lǒu","篓":"lǒu","漏":"lòu","陋":"lòu","芦":"lú","卢":"lú","颅":"lú","庐":"lú","炉":"lú","掳":"lǔ","卤":"lǔ","虏":"lǔ","鲁":"lǔ","麓":"lù","碌":"lù","露":"lù","路":"lù","赂":"lù","鹿":"lù","潞":"lù","禄":"lù","录":"lù","陆":"lù","戮":"lù","驴":"lǘ","吕":"lǚ","铝":"lǚ","侣":"lǚ","旅":"lǚ","履":"lǚ","屡":"lǚ","缕":"lǚ","虑":"lǜ","氯":"lǜ","律":"lǜ","率":"lǜ","滤":"lǜ","绿":"lǜ","峦":"luán","挛":"luán","孪":"luán","滦":"luán","卵":"luǎn","乱":"luàn","掠":"lüě","略":"lüè","抡":"lún","轮":"lún","伦":"lún","仑":"lún","沦":"lún","纶":"lún","论":"lùn","萝":"luó","螺":"luó","罗":"luó","逻":"luó","锣":"luó","箩":"luó","骡":"luó","裸":"luǒ","落":"luò","洛":"luò","骆":"luò","络":"luò","妈":"mā","麻":"má","玛":"mǎ","码":"mǎ","蚂":"mǎ","马":"mǎ","骂":"mà","嘛":"ma","吗":"ma","埋":"mái","买":"mǎi","麦":"mài","卖":"mài","迈":"mài","脉":"mài","瞒":"mán","馒":"mán","蛮":"mán","满":"mǎn","蔓":"màn","曼":"màn","慢":"màn","漫":"màn","谩":"màn","芒":"máng","茫":"máng","盲":"máng","氓":"máng","忙":"máng","莽":"mǎng","猫":"māo","茅":"máo","锚":"máo","毛":"máo","矛":"máo","铆":"mǎo","卯":"mǎo","茂":"mào","冒":"mào","帽":"mào","貌":"mào","贸":"mào","么":"me","玫":"méi","枚":"méi","梅":"méi","酶":"méi","霉":"méi","煤":"méi","没":"méi","眉":"méi","媒":"méi","镁":"měi","每":"měi","美":"měi","昧":"mèi","寐":"mèi","妹":"mèi","媚":"mèi","门":"mén","闷":"mèn","们":"mén","萌":"méng","蒙":"méng","檬":"méng","盟":"méng","锰":"měng","猛":"měng","梦":"mèng","孟":"mèng","眯":"mī","醚":"mí","靡":"mí","糜":"mí","迷":"mí","谜":"mí","弥":"mí","米":"mǐ","秘":"mì","觅":"mì","泌":"mì","蜜":"mì","密":"mì","幂":"mì","棉":"mián","眠":"mián","绵":"mián","冕":"miǎn","免":"miǎn","勉":"miǎn","娩":"miǎn","缅":"miǎn","面":"miàn","苗":"miáo","描":"miáo","瞄":"miáo","藐":"miǎo","秒":"miǎo","渺":"miǎo","庙":"miào","妙":"miào","蔑":"miè","灭":"miè","民":"mín","抿":"mǐn","皿":"mǐn","敏":"mǐn","悯":"mǐn","闽":"mǐn","明":"míng","螟":"míng","鸣":"míng","铭":"míng","名":"míng","命":"mìng","谬":"miù","摸":"mō","摹":"mó","蘑":"mó","模":"mó","膜":"mó","磨":"mó","摩":"mó","魔":"mó","抹":"mò","末":"mò","莫":"mò","墨":"mò","默":"mò","沫":"mò","漠":"mò","寞":"mò","陌":"mò","谋":"móu","牟":"móu","某":"mǒu","拇":"mǔ","牡":"mǔ","亩":"mǔ","姆":"mǔ","母":"mǔ","墓":"mù","暮":"mù","幕":"mù","募":"mù","慕":"mù","木":"mù","目":"mù","睦":"mù","牧":"mù","穆":"mù","拿":"ná","哪":"nǎ","呐":"nà","钠":"nà","那":"nà","娜":"nà","纳":"nà","氖":"nǎi","乃":"nǎi","奶":"nǎi","耐":"nai","奈":"nai","南":"nán","男":"nán","难":"nán","囊":"náng","挠":"náo","脑":"nǎo","恼":"nǎo","闹":"nào","淖":"nào","呢":"ne","馁":"něi","内":"nèi","嫩":"nèn","能":"néng","妮":"nī","霓":"ní","倪":"ní","泥":"ní","尼":"ní","拟":"nǐ","你":"nǐ","匿":"nì","腻":"nì","逆":"nì","溺":"nì","蔫":"niān","拈":"niān","年":"nián","碾":"niǎn","撵":"niǎn","捻":"niǎn","念":"niàn","娘":"niáng","酿":"niàng","鸟":"niǎo","尿":"niào","捏":"niē","聂":"niè","孽":"niè","啮":"niè","镊":"niè","镍":"niè","涅":"niè","您":"nín","柠":"níng","狞":"níng","凝":"níng","宁":"níng","拧":"nǐng","泞":"nìng","牛":"niú","扭":"niǔ","钮":"niǔ","纽":"niǔ","脓":"nóng","浓":"nóng","农":"nóng","弄":"nòng","奴":"nú","努":"nǔ","怒":"nù","女":"nǚ","暖":"nuǎn","虐":"nüè","疟":"nüè","挪":"nuó","懦":"nuò","糯":"nuò","诺":"nuò","哦":"ò","欧":"ōu","鸥":"ōu","殴":"ōu","藕":"ǒu","呕":"ǒu","偶":"ǒu","沤":"ōu","啪":"pā","趴":"pā","爬":"pá","帕":"pà","怕":"pà","琶":"pá","拍":"pāi","排":"pái","牌":"pái","徘":"pái","湃":"pai","派":"pai","攀":"pān","潘":"pān","盘":"pán","磐":"pán","盼":"pàn","畔":"pàn","判":"pàn","叛":"pàn","乓":"pāng","庞":"páng","旁":"páng","耪":"pǎng","胖":"pàng","抛":"pāo","咆":"páo","刨":"páo","炮":"pào","袍":"páo","跑":"pǎo","泡":"pào","呸":"pēi","胚":"pēi","培":"péi","裴":"péi","赔":"péi","陪":"péi","配":"pèi","佩":"pèi","沛":"pèi","喷":"pēn","盆":"pén","砰":"pēng","抨":"pēng","烹":"pēng","澎":"péng","彭":"péng","蓬":"péng","棚":"péng","硼":"péng","篷":"péng","膨":"péng","朋":"péng","鹏":"péng","捧":"pěng","碰":"pèng","坯":"pī","砒":"pī","霹":"pī","批":"pī","披":"pī","劈":"pī","琵":"pí","毗":"pí","啤":"pí","脾":"pí","疲":"pí","皮":"pí","匹":"pǐ","痞":"pǐ","僻":"pì","屁":"pì","譬":"pì","篇":"piān","偏":"piān","片":"piàn","骗":"piàn","飘":"piāo","漂":"piāo","瓢":"piáo","票":"piào","撇":"piě","瞥":"piē","拼":"pīn","频":"pín","贫":"pín","品":"pǐn","聘":"pìn","乒":"pīng","坪":"píng","苹":"píng","萍":"píng","平":"píng","凭":"píng","瓶":"píng","评":"píng","屏":"píng","坡":"pō","泼":"pō","颇":"pō","婆":"pó","破":"pò","魄":"pò","迫":"pò","粕":"pò","剖":"pōu","扑":"pū","铺":"pù","仆":"pú","莆":"pú","葡":"pú","菩":"pú","蒲":"pú","埔":"pǔ","朴":"pǔ","圃":"pǔ","普":"pǔ","浦":"pǔ","谱":"pǔ","曝":"pù","瀑":"bào","期":"qī","欺":"qī","栖":"qī","戚":"qī","妻":"qī","七":"qī","凄":"qī","漆":"qī","柒":"qī","沏":"qī","其":"qí","棋":"qí","奇":"qí","歧":"qí","畦":"qí","崎":"qí","脐":"qí","齐":"qí","旗":"qí","祈":"qí","祁":"qí","骑":"qí","起":"qǐ","岂":"qǐ","乞":"qǐ","企":"qǐ","启":"qǐ","契":"qì","砌":"qì","器":"qì","气":"qì","迄":"qì","弃":"qì","汽":"qì","泣":"qì","讫":"qì","掐":"qiā","恰":"qià","洽":"qià","牵":"qiān","扦":"qiān","钎":"qiān","铅":"qiān","千":"qiān","迁":"qiān","签":"qiān","仟":"qiān","谦":"qiān","乾":"qián","黔":"qián","钱":"qián","钳":"qián","前":"qián","潜":"qián","遣":"qiǎn","浅":"qiǎn","谴":"qiǎn","堑":"qiàn","嵌":"qiàn","欠":"qiàn","歉":"qiàn","枪":"qiāng","呛":"qiàng","腔":"qiāng","羌":"qiāng","墙":"qiáng","蔷":"qiáng","强":"qiáng","抢":"qiǎng","橇":"qiāo","锹":"qiāo","敲":"qiāo","悄":"qiāo","桥":"qiáo","瞧":"qiáo","乔":"qiáo","侨":"qiáo","巧":"qiǎo","鞘":"qiào","撬":"qiào","翘":"qiào","峭":"qiào","俏":"qiào","窍":"qiào","切":"qiē","茄":"qié","且":"qiě","怯":"qiè","窃":"qiè","钦":"qīn","侵":"qīn","亲":"qīn","秦":"qín","琴":"qín","勤":"qín","芹":"qín","擒":"qín","禽":"qín","寝":"qǐn","沁":"qìn","青":"qīng","轻":"qīng","氢":"qīng","倾":"qīng","卿":"qīng","清":"qīng","擎":"qíng","晴":"qíng","氰":"qíng","情":"qíng","顷":"qǐng","请":"qǐng","庆":"qìng","琼":"qióng","穷":"qióng","秋":"qiū","丘":"qiū","邱":"qiū","球":"qiú","求":"qiú","囚":"qiú","酋":"qiú","泅":"qiú","趋":"qū","区":"qū","蛆":"qū","曲":"qǔ","躯":"qū","屈":"qū","驱":"qū","渠":"qú","取":"qǔ","娶":"qǔ","龋":"qǔ","趣":"qù","去":"qù","圈":"quān","颧":"quán","权":"quán","醛":"quán","泉":"quán","全":"quán","痊":"quán","拳":"quán","犬":"quǎn","券":"quàn","劝":"quàn","缺":"quē","炔":"quē","瘸":"qué","却":"què","鹊":"què","榷":"què","确":"què","雀":"què","裙":"qún","群":"qún","然":"rán","燃":"rán","冉":"rǎn","染":"rǎn","瓤":"ráng","壤":"rǎng","攘":"rǎng","嚷":"rǎng","让":"ràng","饶":"ráo","扰":"rǎo","绕":"rào","惹":"rě","热":"rè","壬":"rén","仁":"rén","人":"rén","忍":"rěn","韧":"rèn","任":"rèn","认":"rèn","刃":"rèn","妊":"rèn","纫":"rèn","扔":"rēng","仍":"réng","日":"rì","戎":"róng","茸":"róng","蓉":"róng","荣":"róng","融":"róng","熔":"róng","溶":"róng","容":"róng","绒":"róng","冗":"rǒng","揉":"róu","柔":"róu","肉":"ròu","茹":"rú","蠕":"rú","儒":"rú","孺":"rú","如":"rú","辱":"rǔ","乳":"rǔ","汝":"rǔ","入":"rù","褥":"rù","软":"ruǎn","阮":"ruǎn","蕊":"ruǐ","瑞":"ruì","锐":"ruì","闰":"rùn","润":"rùn","若":"ruò","弱":"ruò","撒":"sā","洒":"sǎ","萨":"sà","腮":"sāi","鳃":"sāi","塞":"sāi","赛":"sài","三":"sān","叁":"sān","伞":"sǎn","散":"sàn","桑":"sāng","嗓":"sǎng","丧":"sàng","搔":"sāo","骚":"sāo","扫":"sǎo","嫂":"sǎo","瑟":"sè","色":"sè","涩":"sè","森":"sēn","僧":"sēng","莎":"shā","砂":"shā","杀":"shā","刹":"shā","沙":"shā","纱":"shā","傻":"shǎ","啥":"shá","煞":"shà","筛":"shāi","晒":"shai","珊":"shān","苫":"shān","杉":"shān","山":"shān","删":"shān","煽":"shān","衫":"shān","闪":"shǎn","陕":"shǎn","擅":"shàn","赡":"shàn","膳":"shàn","善":"shàn","汕":"shàn","扇":"shàn","缮":"shàn","墒":"shāng","伤":"shāng","商":"shāng","赏":"shǎng","晌":"shǎng","上":"shàng","尚":"shàng","裳":"shang","梢":"shāo","捎":"shāo","稍":"shāo","烧":"shāo","芍":"sháo","勺":"sháo","韶":"sháo","少":"shǎo","哨":"shào","邵":"shào","绍":"shào","奢":"shē","赊":"shē","蛇":"shé","舌":"shé","舍":"shě","赦":"shè","摄":"shè","射":"shè","慑":"shè","涉":"shè","社":"shè","设":"shè","砷":"shēn","申":"shēn","呻":"shēn","伸":"shēn","身":"shēn","深":"shēn","娠":"shēn","绅":"shēn","神":"shén","沈":"shěn","审":"shěn","婶":"shěn","甚":"shèn","肾":"shèn","慎":"shèn","渗":"shèn","声":"shēng","生":"shēng","甥":"shēng","牲":"shēng","升":"shēng","绳":"shéng","省":"shěng","盛":"shèng","剩":"shèng","胜":"shèng","圣":"shèng","师":"shī","失":"shī","狮":"shī","施":"shī","湿":"shī","诗":"shī","尸":"shī","虱":"shī","十":"shí","石":"shí","拾":"shí","时":"shí","什":"shí","食":"shí","蚀":"shí","实":"shí","识":"shí","史":"shǐ","矢":"shǐ","使":"shǐ","屎":"shǐ","驶":"shǐ","始":"shǐ","式":"shì","示":"shì","士":"shì","世":"shì","柿":"shì","事":"shì","拭":"shì","誓":"shì","逝":"shì","势":"shì","是":"shì","嗜":"shì","噬":"shì","适":"shì","仕":"shì","侍":"shì","释":"shì","饰":"shì","氏":"shì","市":"shì","恃":"shì","室":"shì","视":"shì","试":"shì","收":"shōu","手":"shǒu","首":"shǒu","守":"shǒu","寿":"shòu","授":"shòu","售":"shòu","受":"shòu","瘦":"shòu","兽":"shòu","蔬":"shū","枢":"shū","梳":"shū","殊":"shū","抒":"shū","输":"shū","叔":"shū","舒":"shū","淑":"shū","疏":"shū","书":"shū","赎":"shú","孰":"shú","熟":"shú","薯":"shǔ","暑":"shǔ","曙":"shǔ","署":"shǔ","蜀":"shǔ","黍":"shǔ","鼠":"shǔ","属":"shǔ","术":"shù","述":"shù","树":"shù","束":"shù","戍":"shù","竖":"shù","墅":"shù","庶":"shù","数":"shù","漱":"shù","恕":"shù","刷":"shuā","耍":"shuǎ","摔":"shuāi","衰":"shuāi","甩":"shuǎi","帅":"shuài","栓":"shuān","拴":"shuān","霜":"shuāng","双":"shuāng","爽":"shuǎng","谁":"shuí","水":"shuǐ","睡":"shuì","税":"shuì","吮":"shǔn","瞬":"shùn","顺":"shùn","舜":"shùn","说":"shuō","硕":"shuò","朔":"shuò","烁":"shuò","斯":"sī","撕":"sī","嘶":"sī","思":"sī","私":"sī","司":"sī","丝":"sī","死":"sǐ","肆":"sì","寺":"sì","嗣":"sì","四":"sì","伺":"sì","似":"sì","饲":"sì","巳":"sì","松":"sōng","耸":"sǒng","怂":"sǒng","颂":"sòng","送":"sòng","宋":"sòng","讼":"sòng","诵":"sòng","搜":"sōu","艘":"sōu","擞":"sǒu","嗽":"sòu","苏":"sū","酥":"sū","俗":"sú","素":"sù","速":"sù","粟":"sù","僳":"sù","塑":"sù","溯":"sù","宿":"xiǔ","诉":"sù","肃":"sù","酸":"suān","蒜":"suàn","算":"suàn","虽":"suī","隋":"suí","随":"suí","绥":"suí","髓":"suǐ","碎":"suì","岁":"suì","穗":"suì","遂":"suí","隧":"suì","祟":"suì","孙":"sūn","损":"sǔn","笋":"sǔn","蓑":"suō","梭":"suō","唆":"suō","缩":"suō","琐":"suǒ","索":"suǒ","锁":"suǒ","所":"suǒ","塌":"tā","他":"tā","它":"tā","她":"tā","塔":"tǎ","獭":"tǎ","挞":"tà","蹋":"tà","踏":"tà","胎":"tāi","苔":"tái","抬":"tái","台":"tái","泰":"tai","酞":"tai","太":"tai","态":"tai","汰":"tai","坍":"tān","摊":"tān","贪":"tān","瘫":"tān","滩":"tān","坛":"tán","檀":"tán","痰":"tán","潭":"tán","谭":"tán","谈":"tán","坦":"tǎn","毯":"tǎn","袒":"tǎn","碳":"tàn","探":"tàn","叹":"tàn","炭":"tàn","汤":"tāng","塘":"táng","搪":"táng","堂":"táng","棠":"táng","膛":"táng","唐":"táng","糖":"táng","倘":"tǎng","躺":"tǎng","淌":"tǎng","趟":"tàng","烫":"tàng","掏":"tāo","涛":"tāo","滔":"tāo","绦":"tāo","萄":"táo","桃":"táo","逃":"táo","淘":"táo","陶":"táo","讨":"tǎo","套":"tào","特":"tè","藤":"téng","腾":"téng","疼":"téng","誊":"téng","梯":"tī","剔":"tī","踢":"tī","锑":"tī","提":"tí","题":"tí","蹄":"tí","啼":"tí","体":"tǐ","替":"tì","嚏":"tì","惕":"tì","涕":"tì","剃":"tì","屉":"tì","天":"tiān","添":"tiān","填":"tián","田":"tián","甜":"tián","恬":"tián","舔":"tiǎn","腆":"tiǎn","挑":"tiāo","条":"tiáo","迢":"tiáo","眺":"tiào","跳":"tiào","贴":"tiē","铁":"tiě","帖":"tiē","厅":"tīng","听":"tīng","烃":"tīng","汀":"tīng","廷":"tíng","停":"tíng","亭":"tíng","庭":"tíng","挺":"tǐng","艇":"tǐng","通":"tōng","桐":"tóng","酮":"tóng","瞳":"tóng","同":"tóng","铜":"tóng","彤":"tóng","童":"tóng","桶":"tǒng","捅":"tǒng","筒":"tǒng","统":"tǒng","痛":"tòng","偷":"tōu","投":"tóu","头":"tóu","透":"tòu","凸":"tū","秃":"tū","突":"tū","图":"tú","徒":"tú","途":"tú","涂":"tú","屠":"tú","土":"tǔ","吐":"tǔ","兔":"tù","湍":"tuān","团":"tuán","推":"tuī","颓":"tuí","腿":"tuǐ","蜕":"tuì","褪":"tuì","退":"tuì","吞":"tūn","屯":"tún","臀":"tún","拖":"tuō","托":"tuō","脱":"tuō","鸵":"tuó","陀":"tuó","驮":"tuó","驼":"tuó","椭":"tuǒ","妥":"tuǒ","拓":"tuò","唾":"tuò","挖":"wā","哇":"wa","蛙":"wā","洼":"wā","娃":"wá","瓦":"wǎ","袜":"wà","歪":"wāi","外":"wai","豌":"wān","弯":"wān","湾":"wān","玩":"wán","顽":"wán","丸":"wán","烷":"wán","完":"wán","碗":"wǎn","挽":"wǎn","晚":"wǎn","皖":"wǎn","惋":"wǎn","宛":"wǎn","婉":"wǎn","万":"wàn","腕":"wàn","汪":"wāng","王":"wáng","亡":"wáng","枉":"wǎng","网":"wǎng","往":"wǎng","旺":"wàng","望":"wàng","忘":"wàng","妄":"wàng","威":"wēi","巍":"wēi","微":"wēi","危":"wēi","韦":"wéi","违":"wéi","桅":"wéi","围":"wéi","唯":"wéi","惟":"wéi","为":"wéi","潍":"wéi","维":"wéi","苇":"wěi","萎":"wěi","委":"wěi","伟":"wěi","伪":"wěi","尾":"wěi","纬":"wěi","未":"wèi","蔚":"wèi","味":"wèi","畏":"wèi","胃":"wèi","喂":"wèi","魏":"wèi","位":"wèi","渭":"wèi","谓":"wèi","尉":"wèi","慰":"wèi","卫":"wèi","瘟":"wēn","温":"wēn","蚊":"wén","文":"wén","闻":"wén","纹":"wén","吻":"wěn","稳":"wěn","紊":"wěn","问":"wèn","嗡":"wēng","翁":"wēng","瓮":"wèng","挝":"wō","蜗":"wō","涡":"wō","窝":"wō","我":"wǒ","斡":"wò","卧":"wò","握":"wò","沃":"wò","巫":"wū","呜":"wū","钨":"wū","乌":"wū","污":"wū","诬":"wū","屋":"wū","无":"wú","芜":"wú","梧":"wú","吾":"wú","吴":"wú","毋":"wú","武":"wǔ","五":"wǔ","捂":"wǔ","午":"wǔ","舞":"wǔ","伍":"wǔ","侮":"wǔ","坞":"wù","戊":"wù","雾":"wù","晤":"wù","物":"wù","勿":"wù","务":"wù","悟":"wù","误":"wù","昔":"xī","熙":"xī","析":"xī","西":"xī","硒":"xī","矽":"xī","晰":"xī","嘻":"xī","吸":"xī","锡":"xī","牺":"xī","稀":"xī","息":"xī","希":"xī","悉":"xī","膝":"xī","夕":"xī","惜":"xī","熄":"xī","烯":"xī","溪":"xī","汐":"xī","犀":"xī","檄":"xí","袭":"xí","席":"xí","习":"xí","媳":"xí","喜":"xǐ","铣":"xǐ","洗":"xǐ","系":"xì","隙":"xì","戏":"xì","细":"xì","瞎":"xiā","虾":"xiā","匣":"xiá","霞":"xiá","辖":"xiá","暇":"xiá","峡":"xiá","侠":"xiá","狭":"xiá","下":"xià","厦":"shà","夏":"xià","吓":"xià","掀":"xiān","锨":"xiān","先":"xiān","仙":"xiān","鲜":"xiān","纤":"xiān","咸":"xián","贤":"xián","衔":"xián","舷":"xián","闲":"xián","涎":"xián","弦":"xián","嫌":"xián","显":"xiǎn","险":"xiǎn","现":"xiàn","献":"xiàn","县":"xiàn","腺":"xiàn","馅":"xiàn","羡":"xiàn","宪":"xiàn","陷":"xiàn","限":"xiàn","线":"xiàn","相":"xiāng","厢":"xiāng","镶":"xiāng","香":"xiāng","箱":"xiāng","襄":"xiāng","湘":"xiāng","乡":"xiāng","翔":"xiáng","祥":"xiáng","详":"xiáng","想":"xiǎng","响":"xiǎng","享":"xiǎng","项":"xiàng","巷":"xiàng","橡":"xiàng","像":"xiàng","向":"xiàng","象":"xiàng","萧":"xiāo","硝":"xiāo","霄":"xiāo","削":"xuē","哮":"xiāo","嚣":"xiāo","销":"xiāo","消":"xiāo","宵":"xiāo","淆":"xiáo","晓":"xiǎo","小":"xiǎo","孝":"xiào","校":"xiào","肖":"xiāo","啸":"xiào","笑":"xiào","效":"xiào","楔":"xiē","些":"xiē","歇":"xiē","蝎":"xiē","鞋":"xié","协":"xié","挟":"xiā","携":"xié","邪":"xié","斜":"xié","胁":"xié","谐":"xié","写":"xiě","械":"xiè","卸":"xiè","蟹":"xiè","懈":"xiè","泄":"xiè","泻":"xiè","谢":"xiè","屑":"xiè","薪":"xīn","芯":"xīn","锌":"xīn","欣":"xīn","辛":"xīn","新":"xīn","忻":"xīn","心":"xīn","信":"xìn","衅":"xìn","星":"xīng","腥":"xīng","猩":"xīng","惺":"xīng","兴":"xīng","刑":"xíng","型":"xíng","形":"xíng","邢":"xíng","行":"xíng","醒":"xǐng","幸":"xìng","杏":"xìng","性":"xìng","姓":"xìng","兄":"xiōng","凶":"xiōng","胸":"xiōng","匈":"xiōng","汹":"xiōng","雄":"xióng","熊":"xióng","休":"xiū","修":"xiū","羞":"xiū","朽":"xiǔ","嗅":"xiù","锈":"xiù","秀":"xiù","袖":"xiù","绣":"xiù","墟":"xū","戌":"xū","需":"xū","虚":"xū","嘘":"xū","须":"xū","徐":"xú","许":"xǔ","蓄":"xù","酗":"xù","叙":"xù","旭":"xù","序":"xù","畜":"chù","恤":"xù","絮":"xù","婿":"xù","绪":"xù","续":"xù","轩":"xuān","喧":"xuān","宣":"xuān","悬":"xuán","旋":"xuán","玄":"xuán","选":"xuǎn","癣":"xuǎn","眩":"xuàn","绚":"xuàn","靴":"xuē","薛":"xuē","学":"xué","穴":"xué","雪":"xuě","血":"xuè","勋":"xūn","熏":"xūn","循":"xún","旬":"xún","询":"xún","寻":"xún","驯":"xùn","巡":"xún","殉":"xùn","汛":"xùn","训":"xùn","讯":"xùn","逊":"xùn","迅":"xùn","压":"yā","押":"yā","鸦":"yā","鸭":"yā","呀":"ya","丫":"yā","芽":"yá","牙":"yá","蚜":"yá","崖":"yá","衙":"yá","涯":"yá","雅":"yǎ","哑":"yǎ","亚":"yà","讶":"yà","焉":"yān","咽":"yān","阉":"yān","烟":"yān","淹":"yān","盐":"yán","严":"yán","研":"yán","蜒":"yán","岩":"yán","延":"yán","言":"yán","颜":"yán","阎":"yán","炎":"yán","沿":"yán","奄":"yǎn","掩":"yǎn","眼":"yǎn","衍":"yǎn","演":"yǎn","艳":"yàn","堰":"yàn","燕":"yàn","厌":"yàn","砚":"yàn","雁":"yàn","唁":"yàn","彦":"yàn","焰":"yàn","宴":"yàn","谚":"yàn","验":"yàn","殃":"yāng","央":"yāng","鸯":"yāng","秧":"yāng","杨":"yáng","扬":"yáng","佯":"yáng","疡":"yáng","羊":"yáng","洋":"yáng","阳":"yáng","氧":"yǎng","仰":"yǎng","痒":"yǎng","养":"yǎng","样":"yàng","漾":"yàng","邀":"yāo","腰":"yāo","妖":"yāo","瑶":"yáo","摇":"yáo","尧":"yáo","遥":"yáo","窑":"yáo","谣":"yáo","姚":"yáo","咬":"yǎo","舀":"yǎo","药":"yào","要":"yào","耀":"yào","椰":"yē","噎":"yē","耶":"yē","爷":"yé","野":"yě","冶":"yě","也":"yě","页":"yè","掖":"yè","业":"yè","叶":"yè","曳":"yè","腋":"yè","夜":"yè","液":"yè","一":"yī","壹":"yī","医":"yī","揖":"yī","铱":"yī","依":"yī","伊":"yī","衣":"yī","颐":"yí","夷":"yí","遗":"yí","移":"yí","仪":"yí","胰":"yí","疑":"yí","沂":"yí","宜":"yí","姨":"yí","彝":"yí","椅":"yǐ","蚁":"yǐ","倚":"yǐ","已":"yǐ","乙":"yǐ","矣":"yǐ","以":"yǐ","艺":"yì","抑":"yì","易":"yì","邑":"yì","屹":"yì","亿":"yì","役":"yì","臆":"yì","逸":"yì","肄":"yì","疫":"yì","亦":"yì","裔":"yì","意":"yì","毅":"yì","忆":"yì","义":"yì","益":"yì","溢":"yì","诣":"yì","议":"yì","谊":"yì","译":"yì","异":"yì","翼":"yì","翌":"yì","绎":"yì","茵":"yīn","荫":"yīn","因":"yīn","殷":"yīn","音":"yīn","阴":"yīn","姻":"yīn","吟":"yín","银":"yín","淫":"yín","寅":"yín","饮":"yǐn","尹":"yǐn","引":"yǐn","隐":"yǐn","印":"yìn","英":"yīng","樱":"yīng","婴":"yīng","鹰":"yīng","应":"yīng","缨":"yīng","莹":"yíng","萤":"yíng","营":"yíng","荧":"yíng","蝇":"yíng","迎":"yíng","赢":"yíng","盈":"yíng","影":"yǐng","颖":"yǐng","硬":"yìng","映":"yìng","哟":"yō","拥":"yōng","佣":"yòng","臃":"yōng","痈":"yōng","庸":"yōng","雍":"yōng","踊":"yǒng","蛹":"yǒng","咏":"yǒng","泳":"yǒng","涌":"yǒng","永":"yǒng","恿":"yǒng","勇":"yǒng","用":"yòng","幽":"yōu","优":"yōu","悠":"yōu","忧":"yōu","尤":"yóu","由":"yóu","邮":"yóu","铀":"yóu","犹":"yóu","油":"yóu","游":"yóu","酉":"yǒu","有":"yǒu","友":"yǒu","右":"yòu","佑":"yòu","釉":"yòu","诱":"yòu","又":"yòu","幼":"yòu","迂":"yū","淤":"yū","于":"yú","盂":"yú","榆":"yú","虞":"yú","愚":"yú","舆":"yú","余":"yú","俞":"yú","逾":"yú","鱼":"yú","愉":"yú","渝":"yú","渔":"yú","隅":"yú","予":"yǔ","娱":"yú","雨":"yǔ","与":"yǔ","屿":"yǔ","禹":"yǔ","宇":"yǔ","语":"yǔ","羽":"yǔ","玉":"yù","域":"yù","芋":"yù","郁":"yù","吁":"yù","遇":"yù","喻":"yù","峪":"yù","御":"yù","愈":"yù","欲":"yù","狱":"yù","育":"yù","誉":"yù","浴":"yù","寓":"yù","裕":"yù","预":"yù","豫":"yù","驭":"yù","鸳":"yuān","渊":"yuān","冤":"yuān","元":"yuán","垣":"yuán","袁":"yuán","原":"yuán","援":"yuán","辕":"yuán","园":"yuán","员":"yuán","圆":"yuán","猿":"yuán","源":"yuán","缘":"yuán","远":"yuǎn","苑":"yuàn","愿":"yuàn","怨":"yuàn","院":"yuàn","曰":"yuē","约":"yuē","越":"yuè","跃":"yuè","钥":"yào","岳":"yuè","粤":"yuè","月":"yuè","悦":"yuè","阅":"yuè","耘":"yún","云":"yún","郧":"yún","匀":"yún","陨":"yǔn","允":"yǔn","运":"yùn","蕴":"yùn","酝":"yùn","晕":"yūn","韵":"yùn","孕":"yùn","匝":"zā","砸":"zá","杂":"zá","栽":"zāi","哉":"zāi","灾":"zāi","宰":"zǎi","载":"zǎi","再":"zài","在":"zài","咱":"zán","攒":"zǎn","暂":"zàn","赞":"zàn","赃":"zāng","脏":"zāng","葬":"zàng","遭":"zāo","糟":"zāo","凿":"záo","藻":"zǎo","枣":"zǎo","早":"zǎo","澡":"zǎo","蚤":"zǎo","躁":"zào","噪":"zào","造":"zào","皂":"zào","灶":"zào","燥":"zào","责":"zé","择":"zé","则":"zé","泽":"zé","贼":"zéi","怎":"zěn","增":"zēng","憎":"zēng","曾":"céng","赠":"zèng","扎":"zhā","喳":"zhā","渣":"zhā","札":"zhá","轧":"zhá","铡":"zhá","闸":"zhá","眨":"zhǎ","栅":"shān","榨":"zhà","咋":"zǎ","乍":"zhà","炸":"zhà","诈":"zhà","摘":"zhāi","斋":"zhāi","宅":"zhái","窄":"zhǎi","债":"zhai","寨":"zhai","瞻":"zhān","毡":"zhān","詹":"zhān","粘":"zhān","沾":"zhān","盏":"zhǎn","斩":"zhǎn","辗":"niǎn","崭":"zhǎn","展":"zhǎn","蘸":"zhàn","栈":"zhàn","占":"zhàn","战":"zhàn","站":"zhàn","湛":"zhàn","绽":"zhàn","樟":"zhāng","章":"zhāng","彰":"zhāng","漳":"zhāng","张":"zhāng","掌":"zhǎng","涨":"zhǎng","杖":"zhàng","丈":"zhàng","帐":"zhàng","账":"zhàng","仗":"zhàng","胀":"zhàng","瘴":"zhàng","障":"zhàng","招":"zhāo","昭":"zhāo","找":"zhǎo","沼":"zhǎo","赵":"zhào","照":"zhào","罩":"zhào","兆":"zhào","肇":"zhào","召":"zhào","遮":"zhē","折":"shé","哲":"zhé","蛰":"zhé","辙":"zhé","者":"zhě","锗":"zhě","蔗":"zhè","这":"zhè","浙":"zhè","珍":"zhēn","斟":"zhēn","真":"zhēn","甄":"zhēn","砧":"zhēn","臻":"zhēn","贞":"zhēn","针":"zhēn","侦":"zhēn","枕":"zhěn","疹":"zhěn","诊":"zhěn","震":"zhèn","振":"zhèn","镇":"zhèn","阵":"zhèn","蒸":"zhēng","挣":"zhèng","睁":"zhēng","征":"zhēng","狰":"zhēng","争":"zhēng","怔":"zhēng","整":"zhěng","拯":"zhěng","正":"zhèng","政":"zhèng","帧":"zhēn","症":"zhèng","郑":"zhèng","证":"zhèng","芝":"zhī","枝":"zhī","支":"zhī","吱":"zī","蜘":"zhī","知":"zhī","肢":"zhī","脂":"zhī","汁":"zhī","之":"zhī","织":"zhī","职":"zhí","直":"zhí","植":"zhí","殖":"zhí","执":"zhí","值":"zhí","侄":"zhí","址":"zhǐ","指":"zhǐ","止":"zhǐ","趾":"zhǐ","只":"zhī","旨":"zhǐ","纸":"zhǐ","志":"zhì","挚":"zhì","掷":"zhì","至":"zhì","致":"zhì","置":"zhì","帜":"zhì","峙":"zhì","制":"zhì","智":"zhì","秩":"zhì","稚":"zhì","质":"zhì","炙":"zhì","痔":"zhì","滞":"zhì","治":"zhì","窒":"zhì","中":"zhōng","盅":"zhōng","忠":"zhōng","钟":"zhōng","衷":"zhōng","终":"zhōng","种":"zhǒng","肿":"zhǒng","重":"zhòng","仲":"zhòng","众":"zhòng","舟":"zhōu","周":"zhōu","州":"zhōu","洲":"zhōu","诌":"zhōu","粥":"zhōu","轴":"zhóu","肘":"zhǒu","帚":"zhǒu","咒":"zhòu","皱":"zhòu","宙":"zhòu","昼":"zhòu","骤":"zhòu","珠":"zhū","株":"zhū","蛛":"zhū","朱":"zhū","猪":"zhū","诸":"zhū","诛":"zhū","逐":"zhú","竹":"zhú","烛":"zhú","煮":"zhǔ","拄":"zhǔ","瞩":"zhǔ","嘱":"zhǔ","主":"zhǔ","著":"zhù","柱":"zhù","助":"zhù","蛀":"zhù","贮":"zhù","铸":"zhù","筑":"zhù","住":"zhù","注":"zhù","祝":"zhù","驻":"zhù","抓":"zhuā","爪":"zhǎo","拽":"zhuài","专":"zhuān","砖":"zhuān","转":"zhuǎn","撰":"zhuàn","赚":"zuàn","篆":"zhuàn","桩":"zhuāng","庄":"zhuāng","装":"zhuāng","妆":"zhuāng","撞":"zhuàng","壮":"zhuàng","状":"zhuàng","椎":"zhuī","锥":"zhuī","追":"zhuī","赘":"zhuì","坠":"zhuì","缀":"zhuì","谆":"zhūn","准":"zhǔn","捉":"zhuō","拙":"zhuō","卓":"zhuó","桌":"zhuō","琢":"zhuó","茁":"zhuó","酌":"zhuó","啄":"zhuó","着":"zhe","灼":"zhuó","浊":"zhuó","兹":"zī","咨":"zī","资":"zī","姿":"zī","滋":"zī","淄":"zī","孜":"zī","紫":"zǐ","仔":"zǎi","籽":"zǐ","滓":"zǐ","子":"zǐ","自":"zì","渍":"zì","字":"zì","鬃":"zōng","棕":"zōng","踪":"zōng","宗":"zōng","综":"zōng","总":"zǒng","纵":"zòng","邹":"zōu","走":"zǒu","奏":"zòu","揍":"zòu","租":"zū","足":"zú","卒":"zú","族":"zú","祖":"zǔ","诅":"zǔ","阻":"zǔ","组":"zǔ","钻":"zuàn","纂":"zuǎn","嘴":"zuǐ","醉":"zuì","最":"zuì","罪":"zuì","尊":"zūn","遵":"zūn","昨":"zuó","左":"zuǒ","佐":"zuǒ","柞":"zhà","做":"zuò","作":"zuò","坐":"zuò","座":"zuò"};




/***********工具***************/
function debug(msg) {
	//console.info(msg);
}

//浏览器类型判断

function browserFlag() {
	var Sys = {};
	var ua = navigator.userAgent.toLowerCase();
	var s;
	(s = ua.match(/msie ([\d.]+)/)) ? Sys.ie = s[1] :
		(s = ua.match(/firefox\/([\d.]+)/)) ? Sys.firefox = s[1] :
		(s = ua.match(/chrome\/([\d.]+)/)) ? Sys.chrome = s[1] :
		(s = ua.match(/opera.([\d.]+)/)) ? Sys.opera = s[1] :
		(s = ua.match(/version\/([\d.]+).*safari/)) ? Sys.safari = s[1] : 0;
	return Sys;
}

//cookie功能--------------------------
//设置cookie//两个参数，一个是cookie的名子，一个是值

function SetCookie(name, value) {
	//此 cookie 将被保存 30 天
	var Days = 30;
	var exp = new Date();
	exp.setTime(exp.getTime() + Days * 24 * 60 * 60 * 1000);
	document.cookie = name + "=" + escape(value) + ";expires=" + exp.toGMTString();
}

//取cookies
function getCookie(name) {
	var arr = document.cookie.match(new RegExp("(^| )" + name + "=([^;]*)(;|$)"));
	if (arr != null) return unescape(arr[2]);
	return null;
}

//删除cookie

function delCookie(name) {
	var exp = new Date();
	exp.setTime(exp.getTime() - 1);
	var cval = getCookie(name);
	if (cval != null) document.cookie = name + "=" + cval + ";expires=" + exp.toGMTString();
}

// 获取x，y位置的element

function getHTMLElementsAtPoint(x, y) {
	var tags = ",";
	var e = document.elementFromPoint(x, y);
	return e;
	while (e) {
		if (e.tagName) {
			tags += e.tagName + ',';
		}
		e = e.parentNode;
	}
	return tags;
}

// fengjunfeng 搜索使用

function changefoucs(newnav) {
	document.getElementById(newnav).style.display = "block";
}

function changeblur(newnav) {
	document.getElementById(newnav).style.display = "none";
}

function changeinput(newid) {
	if (newid.value != "") {
		newid.value = "";
	}
}

function blurinput(newid) {
	if (newid.value == "") {
		newid.value = "请输入关键词"
	}
}

function getText(element) {
	var elementText;
	if (element.nodeName == "H1" || element.nodeName == "H2" || element.nodeName == "H3" || element.nodeName == "H4" || element.nodeName == "H5" || element.nodeName == "H6")

	{
		element = element.firstChild;
	}
	if (element.nodeName == "#text") {
		elementText = thisElement.nodeValue;
	} else if (element.nodeName == "IMG") {
		if (element.getAttribute("alt")) {
			elementText = element.getAttribute("alt");
		} else if (element.getAttribute("title")) {
			elementText = element.getAttribute("title");
		} else {
			elementText = document.title;
		}
	} else {
		elementText = element.innerText || element.textContent;
	}
	return elementText;
}

// 简繁转换方法

function JTPYStr() {
	return '万与丑专业丛东丝丢两严丧个丬丰临为丽举么义乌乐乔习乡书买乱争于亏云亘亚产亩亲亵亸亿仅从仑仓仪们价众优伙会伛伞伟传伤伥伦伧伪伫体余佣佥侠侣侥侦侧侨侩侪侬俣俦俨俩俪俭债倾偬偻偾偿傥傧储傩儿兑兖党兰关兴兹养兽冁内冈册写军农冢冯冲决况冻净凄凉凌减凑凛几凤凫凭凯击凼凿刍划刘则刚创删别刬刭刽刿剀剂剐剑剥剧劝办务劢动励劲劳势勋勐勚匀匦匮区医华协单卖卢卤卧卫却卺厂厅历厉压厌厍厕厢厣厦厨厩厮县参叆叇双发变叙叠叶号叹叽吁后吓吕吗吣吨听启吴呒呓呕呖呗员呙呛呜咏咔咙咛咝咤咴咸哌响哑哒哓哔哕哗哙哜哝哟唛唝唠唡唢唣唤唿啧啬啭啮啰啴啸喷喽喾嗫呵嗳嘘嘤嘱噜噼嚣嚯团园囱围囵国图圆圣圹场坂坏块坚坛坜坝坞坟坠垄垅垆垒垦垧垩垫垭垯垱垲垴埘埙埚埝埯堑堕塆墙壮声壳壶壸处备复够头夸夹夺奁奂奋奖奥妆妇妈妩妪妫姗姜娄娅娆娇娈娱娲娴婳婴婵婶媪嫒嫔嫱嬷孙学孪宁宝实宠审宪宫宽宾寝对寻导寿将尔尘尧尴尸尽层屃屉届属屡屦屿岁岂岖岗岘岙岚岛岭岳岽岿峃峄峡峣峤峥峦崂崃崄崭嵘嵚嵛嵝嵴巅巩巯币帅师帏帐帘帜带帧帮帱帻帼幂幞干并广庄庆庐庑库应庙庞废庼廪开异弃张弥弪弯弹强归当录彟彦彻径徕御忆忏忧忾怀态怂怃怄怅怆怜总怼怿恋恳恶恸恹恺恻恼恽悦悫悬悭悯惊惧惨惩惫惬惭惮惯愍愠愤愦愿慑慭憷懑懒懔戆戋戏戗战戬户扎扑扦执扩扪扫扬扰抚抛抟抠抡抢护报担拟拢拣拥拦拧拨择挂挚挛挜挝挞挟挠挡挢挣挤挥挦捞损捡换捣据捻掳掴掷掸掺掼揸揽揿搀搁搂搅携摄摅摆摇摈摊撄撑撵撷撸撺擞攒敌敛数斋斓斗斩断无旧时旷旸昙昼昽显晋晒晓晔晕晖暂暧札术朴机杀杂权条来杨杩杰极构枞枢枣枥枧枨枪枫枭柜柠柽栀栅标栈栉栊栋栌栎栏树栖样栾桊桠桡桢档桤桥桦桧桨桩梦梼梾检棂椁椟椠椤椭楼榄榇榈榉槚槛槟槠横樯樱橥橱橹橼檐檩欢欤欧歼殁殇残殒殓殚殡殴毁毂毕毙毡毵氇气氢氩氲汇汉污汤汹沓沟没沣沤沥沦沧沨沩沪沵泞泪泶泷泸泺泻泼泽泾洁洒洼浃浅浆浇浈浉浊测浍济浏浐浑浒浓浔浕涂涌涛涝涞涟涠涡涢涣涤润涧涨涩淀渊渌渍渎渐渑渔渖渗温游湾湿溃溅溆溇滗滚滞滟滠满滢滤滥滦滨滩滪漤潆潇潋潍潜潴澜濑濒灏灭灯灵灾灿炀炉炖炜炝点炼炽烁烂烃烛烟烦烧烨烩烫烬热焕焖焘煅煳熘爱爷牍牦牵牺犊犟状犷犸犹狈狍狝狞独狭狮狯狰狱狲猃猎猕猡猪猫猬献獭玑玙玚玛玮环现玱玺珉珏珐珑珰珲琎琏琐琼瑶瑷璇璎瓒瓮瓯电画畅畲畴疖疗疟疠疡疬疮疯疱疴痈痉痒痖痨痪痫痴瘅瘆瘗瘘瘪瘫瘾瘿癞癣癫癯皑皱皲盏盐监盖盗盘眍眦眬着睁睐睑瞒瞩矫矶矾矿砀码砖砗砚砜砺砻砾础硁硅硕硖硗硙硚确硷碍碛碜碱碹磙礼祎祢祯祷祸禀禄禅离秃秆种积称秽秾稆税稣稳穑穷窃窍窑窜窝窥窦窭竖竞笃笋笔笕笺笼笾筑筚筛筜筝筹签简箓箦箧箨箩箪箫篑篓篮篱簖籁籴类籼粜粝粤粪粮糁糇紧絷纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾线绀绁绂练组绅细织终绉绊绋绌绍绎经绐绑绒结绔绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继绨绩绪绫绬续绮绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缋缌缍缎缏缐缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵罂网罗罚罢罴羁羟羡翘翙翚耢耧耸耻聂聋职聍联聩聪肃肠肤肷肾肿胀胁胆胜胧胨胪胫胶脉脍脏脐脑脓脔脚脱脶脸腊腌腘腭腻腼腽腾膑臜舆舣舰舱舻艰艳艹艺节芈芗芜芦苁苇苈苋苌苍苎苏苘苹茎茏茑茔茕茧荆荐荙荚荛荜荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭荮药莅莜莱莲莳莴莶获莸莹莺莼萚萝萤营萦萧萨葱蒇蒉蒋蒌蓝蓟蓠蓣蓥蓦蔷蔹蔺蔼蕲蕴薮藁藓虏虑虚虫虬虮虽虾虿蚀蚁蚂蚕蚝蚬蛊蛎蛏蛮蛰蛱蛲蛳蛴蜕蜗蜡蝇蝈蝉蝎蝼蝾螀螨蟏衅衔补衬衮袄袅袆袜袭袯装裆裈裢裣裤裥褛褴襁襕见观觃规觅视觇览觉觊觋觌觍觎觏觐觑觞触觯詟誉誊讠计订讣认讥讦讧讨让讪讫训议讯记讱讲讳讴讵讶讷许讹论讻讼讽设访诀证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩诪诫诬语诮误诰诱诲诳说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴谵谶谷豮贝贞负贠贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆赇赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞赟赠赡赢赣赪赵赶趋趱趸跃跄跖跞践跶跷跸跹跻踊踌踪踬踯蹑蹒蹰蹿躏躜躯车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辞辩辫边辽达迁过迈运还这进远违连迟迩迳迹适选逊递逦逻遗遥邓邝邬邮邹邺邻郁郄郏郐郑郓郦郧郸酝酦酱酽酾酿释里鉅鉴銮錾钆钇针钉钊钋钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铍铎铏铐铑铒铕铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铪铫铬铭铮铯铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗错锚锜锞锟锠锡锢锣锤锥锦锨锩锫锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镆镇镈镉镊镌镍镎镏镐镑镒镕镖镗镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮镯镰镱镲镳镴镶长门闩闪闫闬闭问闯闰闱闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏阐阑阒阓阔阕阖阗阘阙阚阛队阳阴阵阶际陆陇陈陉陕陧陨险随隐隶隽难雏雠雳雾霁霉霭靓静靥鞑鞒鞯鞴韦韧韨韩韪韫韬韵页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颋颌颍颎颏颐频颒颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧风飏飐飑飒飓飔飕飖飗飘飙飚飞飨餍饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋馌馍馎馏馐馑馒馓馔馕马驭驮驯驰驱驲驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅骆骇骈骉骊骋验骍骎骏骐骑骒骓骔骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣骤骥骦骧髅髋髌鬓魇魉鱼鱽鱾鱿鲀鲁鲂鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鳖鳗鳘鳙鳛鳜鳝鳞鳟鳠鳡鳢鳣鸟鸠鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹚鹛鹜鹝鹞鹟鹠鹡鹢鹣鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹯鹰鹱鹲鹳鹴鹾麦麸黄黉黡黩黪黾鼋鼌鼍鼗鼹齄齐齑齿龀龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟志制咨只里系范松没尝尝闹面准钟别闲干尽脏';
}

function FTPYStr() {
	return '萬與醜專業叢東絲丟兩嚴喪個爿豐臨為麗舉麼義烏樂喬習鄉書買亂爭於虧雲亙亞產畝親褻嚲億僅從侖倉儀們價眾優夥會傴傘偉傳傷倀倫傖偽佇體餘傭僉俠侶僥偵側僑儈儕儂俁儔儼倆儷儉債傾傯僂僨償儻儐儲儺兒兌兗黨蘭關興茲養獸囅內岡冊寫軍農塚馮衝決況凍淨淒涼淩減湊凜幾鳳鳧憑凱擊氹鑿芻劃劉則剛創刪別剗剄劊劌剴劑剮劍剝劇勸辦務勱動勵勁勞勢勳猛勩勻匭匱區醫華協單賣盧鹵臥衛卻巹廠廳曆厲壓厭厙廁廂厴廈廚廄廝縣參靉靆雙發變敘疊葉號歎嘰籲後嚇呂嗎唚噸聽啟吳嘸囈嘔嚦唄員咼嗆嗚詠哢嚨嚀噝吒噅鹹呱響啞噠嘵嗶噦嘩噲嚌噥喲嘜嗊嘮啢嗩唕喚呼嘖嗇囀齧囉嘽嘯噴嘍嚳囁嗬噯噓嚶囑嚕劈囂謔團園囪圍圇國圖圓聖壙場阪壞塊堅壇壢壩塢墳墜壟壟壚壘墾坰堊墊埡墶壋塏堖塒塤堝墊垵塹墮壪牆壯聲殼壺壼處備複夠頭誇夾奪奩奐奮獎奧妝婦媽嫵嫗媯姍薑婁婭嬈嬌孌娛媧嫻嫿嬰嬋嬸媼嬡嬪嬙嬤孫學孿寧寶實寵審憲宮寬賓寢對尋導壽將爾塵堯尷屍盡層屭屜屆屬屢屨嶼歲豈嶇崗峴嶴嵐島嶺嶽崠巋嶨嶧峽嶢嶠崢巒嶗崍嶮嶄嶸嶔崳嶁脊巔鞏巰幣帥師幃帳簾幟帶幀幫幬幘幗冪襆幹並廣莊慶廬廡庫應廟龐廢廎廩開異棄張彌弳彎彈強歸當錄彠彥徹徑徠禦憶懺憂愾懷態慫憮慪悵愴憐總懟懌戀懇惡慟懨愷惻惱惲悅愨懸慳憫驚懼慘懲憊愜慚憚慣湣慍憤憒願懾憖怵懣懶懍戇戔戲戧戰戩戶紮撲扡執擴捫掃揚擾撫拋摶摳掄搶護報擔擬攏揀擁攔擰撥擇掛摯攣掗撾撻挾撓擋撟掙擠揮撏撈損撿換搗據撚擄摑擲撣摻摜摣攬撳攙擱摟攪攜攝攄擺搖擯攤攖撐攆擷擼攛擻攢敵斂數齋斕鬥斬斷無舊時曠暘曇晝曨顯晉曬曉曄暈暉暫曖劄術樸機殺雜權條來楊榪傑極構樅樞棗櫪梘棖槍楓梟櫃檸檉梔柵標棧櫛櫳棟櫨櫟欄樹棲樣欒棬椏橈楨檔榿橋樺檜槳樁夢檮棶檢欞槨櫝槧欏橢樓欖櫬櫚櫸檟檻檳櫧橫檣櫻櫫櫥櫓櫞簷檁歡歟歐殲歿殤殘殞殮殫殯毆毀轂畢斃氈毿氌氣氫氬氳彙漢汙湯洶遝溝沒灃漚瀝淪滄渢溈滬濔濘淚澩瀧瀘濼瀉潑澤涇潔灑窪浹淺漿澆湞溮濁測澮濟瀏滻渾滸濃潯濜塗湧濤澇淶漣潿渦溳渙滌潤澗漲澀澱淵淥漬瀆漸澠漁瀋滲溫遊灣濕潰濺漵漊潷滾滯灩灄滿瀅濾濫灤濱灘澦濫瀠瀟瀲濰潛瀦瀾瀨瀕灝滅燈靈災燦煬爐燉煒熗點煉熾爍爛烴燭煙煩燒燁燴燙燼熱煥燜燾煆糊溜愛爺牘犛牽犧犢強狀獷獁猶狽麅獮獰獨狹獅獪猙獄猻獫獵獼玀豬貓蝟獻獺璣璵瑒瑪瑋環現瑲璽瑉玨琺瓏璫琿璡璉瑣瓊瑤璦璿瓔瓚甕甌電畫暢佘疇癤療瘧癘瘍鬁瘡瘋皰屙癰痙癢瘂癆瘓癇癡癉瘮瘞瘺癟癱癮癭癩癬癲臒皚皺皸盞鹽監蓋盜盤瞘眥矓著睜睞瞼瞞矚矯磯礬礦碭碼磚硨硯碸礪礱礫礎硜矽碩硤磽磑礄確鹼礙磧磣堿镟滾禮禕禰禎禱禍稟祿禪離禿稈種積稱穢穠穭稅穌穩穡窮竊竅窯竄窩窺竇窶豎競篤筍筆筧箋籠籩築篳篩簹箏籌簽簡籙簀篋籜籮簞簫簣簍籃籬籪籟糴類秈糶糲粵糞糧糝餱緊縶糸糾紆紅紂纖紇約級紈纊紀紉緯紜紘純紕紗綱納紝縱綸紛紙紋紡紵紖紐紓線紺絏紱練組紳細織終縐絆紼絀紹繹經紿綁絨結絝繞絰絎繪給絢絳絡絕絞統綆綃絹繡綌綏絛繼綈績緒綾緓續綺緋綽緔緄繩維綿綬繃綢綯綹綣綜綻綰綠綴緇緙緗緘緬纜緹緲緝縕繢緦綞緞緶線緱縋緩締縷編緡緣縉縛縟縝縫縗縞纏縭縊縑繽縹縵縲纓縮繆繅纈繚繕繒韁繾繰繯繳纘罌網羅罰罷羆羈羥羨翹翽翬耮耬聳恥聶聾職聹聯聵聰肅腸膚膁腎腫脹脅膽勝朧腖臚脛膠脈膾髒臍腦膿臠腳脫腡臉臘醃膕齶膩靦膃騰臏臢輿艤艦艙艫艱豔艸藝節羋薌蕪蘆蓯葦藶莧萇蒼苧蘇檾蘋莖蘢蔦塋煢繭荊薦薘莢蕘蓽蕎薈薺蕩榮葷滎犖熒蕁藎蓀蔭蕒葒葤藥蒞蓧萊蓮蒔萵薟獲蕕瑩鶯蓴蘀蘿螢營縈蕭薩蔥蕆蕢蔣蔞藍薊蘺蕷鎣驀薔蘞藺藹蘄蘊藪槁蘚虜慮虛蟲虯蟣雖蝦蠆蝕蟻螞蠶蠔蜆蠱蠣蟶蠻蟄蛺蟯螄蠐蛻蝸蠟蠅蟈蟬蠍螻蠑螿蟎蠨釁銜補襯袞襖嫋褘襪襲襏裝襠褌褳襝褲襇褸襤繈襴見觀覎規覓視覘覽覺覬覡覿覥覦覯覲覷觴觸觶讋譽謄訁計訂訃認譏訐訌討讓訕訖訓議訊記訒講諱謳詎訝訥許訛論訩訟諷設訪訣證詁訶評詛識詗詐訴診詆謅詞詘詔詖譯詒誆誄試詿詩詰詼誠誅詵話誕詬詮詭詢詣諍該詳詫諢詡譸誡誣語誚誤誥誘誨誑說誦誒請諸諏諾讀諑誹課諉諛誰諗調諂諒諄誶談誼謀諶諜謊諫諧謔謁謂諤諭諼讒諮諳諺諦謎諞諝謨讜謖謝謠謗諡謙謐謹謾謫譾謬譚譖譙讕譜譎讞譴譫讖穀豶貝貞負貟貢財責賢敗賬貨質販貪貧貶購貯貫貳賤賁貰貼貴貺貸貿費賀貽賊贄賈賄貲賃賂贓資賅贐賕賑賚賒賦賭齎贖賞賜贔賙賡賠賧賴賵贅賻賺賽賾贗讚贇贈贍贏贛赬趙趕趨趲躉躍蹌蹠躒踐躂蹺蹕躚躋踴躊蹤躓躑躡蹣躕躥躪躦軀車軋軌軒軑軔轉軛輪軟轟軲軻轤軸軹軼軤軫轢軺輕軾載輊轎輈輇輅較輒輔輛輦輩輝輥輞輬輟輜輳輻輯轀輸轡轅轄輾轆轍轔辭辯辮邊遼達遷過邁運還這進遠違連遲邇逕跡適選遜遞邐邏遺遙鄧鄺鄔郵鄒鄴鄰鬱郤郟鄶鄭鄆酈鄖鄲醞醱醬釅釃釀釋裏钜鑒鑾鏨釓釔針釘釗釙釕釷釺釧釤鈒釩釣鍆釹鍚釵鈃鈣鈈鈦鈍鈔鍾鈉鋇鋼鈑鈐鑰欽鈞鎢鉤鈧鈁鈥鈄鈕鈀鈺錢鉦鉗鈷缽鈳鉕鈽鈸鉞鑽鉬鉭鉀鈿鈾鐵鉑鈴鑠鉛鉚鈰鉉鉈鉍鈹鐸鉶銬銠鉺銪鋏鋣鐃銍鐺銅鋁銱銦鎧鍘銖銑鋌銩銛鏵銓鉿銚鉻銘錚銫鉸銥鏟銃鐋銨銀銣鑄鐒鋪鋙錸鋱鏈鏗銷鎖鋰鋥鋤鍋鋯鋨鏽銼鋝鋒鋅鋶鐦鐧銳銻鋃鋟鋦錒錆鍺錯錨錡錁錕錩錫錮鑼錘錐錦鍁錈錇錟錠鍵鋸錳錙鍥鍈鍇鏘鍶鍔鍤鍬鍾鍛鎪鍠鍰鎄鍍鎂鏤鎡鏌鎮鎛鎘鑷鐫鎳鎿鎦鎬鎊鎰鎔鏢鏜鏍鏰鏞鏡鏑鏃鏇鏐鐔钁鐐鏷鑥鐓鑭鐠鑹鏹鐙鑊鐳鐶鐲鐮鐿鑔鑣鑞鑲長門閂閃閆閈閉問闖閏闈閑閎間閔閌悶閘鬧閨聞闥閩閭闓閥閣閡閫鬮閱閬闍閾閹閶鬩閿閽閻閼闡闌闃闠闊闋闔闐闒闕闞闤隊陽陰陣階際陸隴陳陘陝隉隕險隨隱隸雋難雛讎靂霧霽黴靄靚靜靨韃鞽韉韝韋韌韍韓韙韞韜韻頁頂頃頇項順須頊頑顧頓頎頒頌頏預顱領頗頸頡頰頲頜潁熲頦頤頻頮頹頷頴穎顆題顒顎顓顏額顳顢顛顙顥纇顫顬顰顴風颺颭颮颯颶颸颼颻飀飄飆飆飛饗饜飣饑飥餳飩餼飪飫飭飯飲餞飾飽飼飿飴餌饒餉餄餎餃餏餅餑餖餓餘餒餕餜餛餡館餷饋餶餿饞饁饃餺餾饈饉饅饊饌饢馬馭馱馴馳驅馹駁驢駔駛駟駙駒騶駐駝駑駕驛駘驍罵駰驕驊駱駭駢驫驪騁驗騂駸駿騏騎騍騅騌驌驂騙騭騤騷騖驁騮騫騸驃騾驄驏驟驥驦驤髏髖髕鬢魘魎魚魛魢魷魨魯魴魺鮁鮃鯰鱸鮋鮓鮒鮊鮑鱟鮍鮐鮭鮚鮳鮪鮞鮦鰂鮜鱠鱭鮫鮮鮺鯗鱘鯁鱺鰱鰹鯉鰣鰷鯀鯊鯇鮶鯽鯒鯖鯪鯕鯫鯡鯤鯧鯝鯢鯰鯛鯨鯵鯴鯔鱝鰈鰏鱨鯷鰮鰃鰓鱷鰍鰒鰉鰁鱂鯿鰠鼇鰭鰨鰥鰩鰟鰜鰳鰾鱈鱉鰻鰵鱅鰼鱖鱔鱗鱒鱯鱤鱧鱣鳥鳩雞鳶鳴鳲鷗鴉鶬鴇鴆鴣鶇鸕鴨鴞鴦鴒鴟鴝鴛鴬鴕鷥鷙鴯鴰鵂鴴鵃鴿鸞鴻鵐鵓鸝鵑鵠鵝鵒鷳鵜鵡鵲鶓鵪鶤鵯鵬鵮鶉鶊鵷鷫鶘鶡鶚鶻鶿鶥鶩鷊鷂鶲鶹鶺鷁鶼鶴鷖鸚鷓鷚鷯鷦鷲鷸鷺鸇鷹鸌鸏鸛鸘鹺麥麩黃黌黶黷黲黽黿鼂鼉鞀鼴齇齊齏齒齔齕齗齟齡齙齠齜齦齬齪齲齷龍龔龕龜誌製谘隻裡係範鬆冇嚐嘗鬨麵準鐘彆閒乾儘臟';
}

function Traditionalized(cc) {
	var str = '',
		ss = JTPYStr(),
		tt = FTPYStr();
	for (var i = 0; i < cc.length; i++) {
		if (cc.charCodeAt(i) > 10000 && ss.indexOf(cc.charAt(i)) != -1) str += tt.charAt(ss.indexOf(cc.charAt(i)));
		else str += cc.charAt(i);
	}
	return str;
}

function Simplized(cc) {
	var str = '',
		ss = JTPYStr(),
		tt = FTPYStr();
	for (var i = 0; i < cc.length; i++) {
		if (cc.charCodeAt(i) > 10000 && tt.indexOf(cc.charAt(i)) != -1) str += ss.charAt(tt.indexOf(cc.charAt(i)));
		else str += cc.charAt(i);
	}
	return str;
}

// HashMap
function HashMap() { 

	var size=0; 
	var entry=new Object(); 
	this.put=function(key,value)
	{ 
		if(!this.containsKey(key)){ 
		size++; 
		entry[key]=value; 
		} 
	} 

	this.get=function(key){ 
		return this.containsKey(key) ? entry[key] : null; 
	}

	this.remove=function(key){ 
		if(this.containsKey(key) && ( delete entry[key] )){ 
			size--; 
		}	 
	}	 

	/**是否包含Key**/ 
	this.containsKey= function (key){ 
		return (key in entry); 
	} 

	/**是否包含Value**/ 
	this.containsValue=function(value){ 
		for(var prop in entry) 
		{ 
			if(entry[prop]==value){ 
			return true; 
			} 
		} 
		return false; 
	} 

	/**所有的Value**/ 
		this.values=function(){ 
			var values=new Array(); 
			for(var prop in entry) 
			{ 
				values.push(entry[prop]); 
			} 
			return values; 
	} 

	/**所有的 Key**/ 
	this.keys=function(){ 
		var keys=new Array(); 
		for(var prop in entry) 
		{ 
			keys.push(prop); 
		} 
		return keys; 
	}

	/**Map size**/ 
	this.size=function(){ 
		return size; 
	} 

	/**清空Map**/ 
	this.clear=function(){ 
		size=0; 
		entry=new Object(); 
	} 
}

// md5
var hexcase = 0; /* hex output format. 0 - lowercase; 1 - uppercase */ 
var b64pad = ""; /* base-64 pad character. "=" for strict RFC compliance */ 
var chrsz = 8; /* bits per input character. 8 - ASCII; 16 - Unicode */

function hex_md5(s){ return binl2hex(core_md5(str2binl(s), s.length * chrsz));} 

function core_md5(x, len) 
{ 
x[len >> 5] |= 0x80 << ((len) % 32); 
x[(((len + 64) >>> 9) << 4) + 14] = len;

var a = 1732584193; 
var b = -271733879; 
var c = -1732584194; 
var d = 271733878;

for(var i = 0; i < x.length; i += 16) 
{ 
var olda = a; 
var oldb = b; 
var oldc = c; 
var oldd = d;

a = md5_ff(a, b, c, d, x[i+ 0], 7 , -680876936); 
d = md5_ff(d, a, b, c, x[i+ 1], 12, -389564586); 
c = md5_ff(c, d, a, b, x[i+ 2], 17, 606105819); 
b = md5_ff(b, c, d, a, x[i+ 3], 22, -1044525330); 
a = md5_ff(a, b, c, d, x[i+ 4], 7 , -176418897); 
d = md5_ff(d, a, b, c, x[i+ 5], 12, 1200080426); 
c = md5_ff(c, d, a, b, x[i+ 6], 17, -1473231341); 
b = md5_ff(b, c, d, a, x[i+ 7], 22, -45705983); 
a = md5_ff(a, b, c, d, x[i+ 8], 7 , 1770035416); 
d = md5_ff(d, a, b, c, x[i+ 9], 12, -1958414417); 
c = md5_ff(c, d, a, b, x[i+10], 17, -42063); 
b = md5_ff(b, c, d, a, x[i+11], 22, -1990404162); 
a = md5_ff(a, b, c, d, x[i+12], 7 , 1804603682); 
d = md5_ff(d, a, b, c, x[i+13], 12, -40341101); 
c = md5_ff(c, d, a, b, x[i+14], 17, -1502002290); 
b = md5_ff(b, c, d, a, x[i+15], 22, 1236535329);

a = md5_gg(a, b, c, d, x[i+ 1], 5 , -165796510); 
d = md5_gg(d, a, b, c, x[i+ 6], 9 , -1069501632); 
c = md5_gg(c, d, a, b, x[i+11], 14, 643717713); 
b = md5_gg(b, c, d, a, x[i+ 0], 20, -373897302); 
a = md5_gg(a, b, c, d, x[i+ 5], 5 , -701558691); 
d = md5_gg(d, a, b, c, x[i+10], 9 , 38016083); 
c = md5_gg(c, d, a, b, x[i+15], 14, -660478335); 
b = md5_gg(b, c, d, a, x[i+ 4], 20, -405537848); 
a = md5_gg(a, b, c, d, x[i+ 9], 5 , 568446438); 
d = md5_gg(d, a, b, c, x[i+14], 9 , -1019803690); 
c = md5_gg(c, d, a, b, x[i+ 3], 14, -187363961); 
b = md5_gg(b, c, d, a, x[i+ 8], 20, 1163531501); 
a = md5_gg(a, b, c, d, x[i+13], 5 , -1444681467); 
d = md5_gg(d, a, b, c, x[i+ 2], 9 , -51403784); 
c = md5_gg(c, d, a, b, x[i+ 7], 14, 1735328473); 
b = md5_gg(b, c, d, a, x[i+12], 20, -1926607734);

a = md5_hh(a, b, c, d, x[i+ 5], 4 , -378558); 
d = md5_hh(d, a, b, c, x[i+ 8], 11, -2022574463); 
c = md5_hh(c, d, a, b, x[i+11], 16, 1839030562); 
b = md5_hh(b, c, d, a, x[i+14], 23, -35309556); 
a = md5_hh(a, b, c, d, x[i+ 1], 4 , -1530992060); 
d = md5_hh(d, a, b, c, x[i+ 4], 11, 1272893353); 
c = md5_hh(c, d, a, b, x[i+ 7], 16, -155497632); 
b = md5_hh(b, c, d, a, x[i+10], 23, -1094730640); 
a = md5_hh(a, b, c, d, x[i+13], 4 , 681279174); 
d = md5_hh(d, a, b, c, x[i+ 0], 11, -358537222); 
c = md5_hh(c, d, a, b, x[i+ 3], 16, -722521979); 
b = md5_hh(b, c, d, a, x[i+ 6], 23, 76029189); 
a = md5_hh(a, b, c, d, x[i+ 9], 4 , -640364487); 
d = md5_hh(d, a, b, c, x[i+12], 11, -421815835); 
c = md5_hh(c, d, a, b, x[i+15], 16, 530742520); 
b = md5_hh(b, c, d, a, x[i+ 2], 23, -995338651);

a = md5_ii(a, b, c, d, x[i+ 0], 6 , -198630844); 
d = md5_ii(d, a, b, c, x[i+ 7], 10, 1126891415); 
c = md5_ii(c, d, a, b, x[i+14], 15, -1416354905); 
b = md5_ii(b, c, d, a, x[i+ 5], 21, -57434055); 
a = md5_ii(a, b, c, d, x[i+12], 6 , 1700485571); 
d = md5_ii(d, a, b, c, x[i+ 3], 10, -1894986606); 
c = md5_ii(c, d, a, b, x[i+10], 15, -1051523); 
b = md5_ii(b, c, d, a, x[i+ 1], 21, -2054922799); 
a = md5_ii(a, b, c, d, x[i+ 8], 6 , 1873313359); 
d = md5_ii(d, a, b, c, x[i+15], 10, -30611744); 
c = md5_ii(c, d, a, b, x[i+ 6], 15, -1560198380); 
b = md5_ii(b, c, d, a, x[i+13], 21, 1309151649); 
a = md5_ii(a, b, c, d, x[i+ 4], 6 , -145523070); 
d = md5_ii(d, a, b, c, x[i+11], 10, -1120210379); 
c = md5_ii(c, d, a, b, x[i+ 2], 15, 718787259); 
b = md5_ii(b, c, d, a, x[i+ 9], 21, -343485551);

a = safe_add(a, olda); 
b = safe_add(b, oldb); 
c = safe_add(c, oldc); 
d = safe_add(d, oldd); 
} 
return Array(a, b, c, d);

}

/* 
* These functions implement the four basic operations the algorithm uses. 
*/ 
function md5_cmn(q, a, b, x, s, t) 
{ 
return safe_add(bit_rol(safe_add(safe_add(a, q), safe_add(x, t)), s),b); 
} 
function md5_ff(a, b, c, d, x, s, t) 
{ 
return md5_cmn((b & c) | ((~b) & d), a, b, x, s, t); 
} 
function md5_gg(a, b, c, d, x, s, t) 
{ 
return md5_cmn((b & d) | (c & (~d)), a, b, x, s, t); 
} 
function md5_hh(a, b, c, d, x, s, t) 
{ 
return md5_cmn(b ^ c ^ d, a, b, x, s, t); 
} 
function md5_ii(a, b, c, d, x, s, t) 
{ 
return md5_cmn(c ^ (b | (~d)), a, b, x, s, t); 
}

/* 
* Calculate the HMAC-MD5, of a key and some data 
*/ 
function core_hmac_md5(key, data) 
{ 
var bkey = str2binl(key); 
if(bkey.length > 16) bkey = core_md5(bkey, key.length * chrsz);

var ipad = Array(16), opad = Array(16); 
for(var i = 0; i < 16; i++) 
{ 
ipad[i] = bkey[i] ^ 0x36363636; 
opad[i] = bkey[i] ^ 0x5C5C5C5C; 
}

var hash = core_md5(ipad.concat(str2binl(data)), 512 + data.length * chrsz); 
return core_md5(opad.concat(hash), 512 + 128); 
}

/* 
* Add integers, wrapping at 2^32. This uses 16-bit operations internally 
* to work around bugs in some JS interpreters. 
*/ 
function safe_add(x, y) 
{ 
var lsw = (x & 0xFFFF) + (y & 0xFFFF); 
var msw = (x >> 16) + (y >> 16) + (lsw >> 16); 
return (msw << 16) | (lsw & 0xFFFF); 
}

/* 
* Bitwise rotate a 32-bit number to the left. 
*/ 
function bit_rol(num, cnt) 
{ 
return (num << cnt) | (num >>> (32 - cnt)); 
}

/* 
* Convert a string to an array of little-endian words 
* If chrsz is ASCII, characters >255 have their hi-byte silently ignored. 
*/ 
function str2binl(str) 
{ 
var bin = Array(); 
var mask = (1 << chrsz) - 1; 
for(var i = 0; i < str.length * chrsz; i += chrsz) 
bin[i>>5] |= (str.charCodeAt(i / chrsz) & mask) << (i%32); 
return bin; 
}

/* 
* Convert an array of little-endian words to a hex string. 
*/ 
function binl2hex(binarray) 
{ 
var hex_tab = hexcase ? "0123456789ABCDEF" : "0123456789abcdef"; 
var str = ""; 
for(var i = 0; i < binarray.length * 4; i++) 
{ 
str += hex_tab.charAt((binarray[i>>2] >> ((i%4)*8+4)) & 0xF) + 
hex_tab.charAt((binarray[i>>2] >> ((i%4)*8 )) & 0xF); 
} 
return str; 
}

/* 
* Convert an array of little-endian words to a base-64 string 
*/ 
function binl2b64(binarray) 
{ 
var tab = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/"; 
var str = ""; 
for(var i = 0; i < binarray.length * 4; i += 3) 
{ 
var triplet = (((binarray[i >> 2] >> 8 * ( i %4)) & 0xFF) << 16) 
| (((binarray[i+1 >> 2] >> 8 * ((i+1)%4)) & 0xFF) << 8 ) 
| ((binarray[i+2 >> 2] >> 8 * ((i+2)%4)) & 0xFF); 
for(var j = 0; j < 4; j++) 
{ 
if(i * 8 + j * 6 > binarray.length * 32) str += b64pad; 
else str += tab.charAt((triplet >> 6*(3-j)) & 0x3F); 
} 
} 
return str; 
} 


//------------------------------------------------------------------------------------
//--------------------------------------公共方法定义结束---------------------------------
//---------------------------文字提示功能定义开始-----------------------------//
var toolbar = new Object();
toolbar.Function = new Object();
var hiddenTagName = "span";
var elementFuncHashMap=new HashMap(); 

function elementContext() {
	this.thisContext 	= new Object();
	this.funcMouseOver 	= new function(){};
	this.funcMouseOut 	= new function(){};
	this.testValue 		= "what is your";
	this.element        = new Object();
}

function initTextTips() {
	var messageboxText = "";
	messageboxText += "<div class=\"disabilitiesLanguage\">";
        // 解决ie6下拉框浮在工具条上的方法
        messageboxText += "<iframe style=\"position:absolute;top:0;left:0;width:100%;height:100%;z-index:-1;filter:alpha(opacity=0);\"></iframe>";
	messageboxText += "<div class=\"LanguageMain\" id=\"language\">";
	messageboxText += "<ul class=\"font_titleBar\">";
	messageboxText += "<li><input type=\"button\" title=\"转换简体字\" id=\"barrierfree_btn01\" class=\"barrierfree_btn01\" onclick=\"toolbar.Function.textTips.simpleModel()\" value=\"简\"/></li>";
	messageboxText += "<li><input type=\"button\" title=\"转换繁体字\" class=\"barrierfree_btn02\" onclick=\"toolbar.Function.textTips.raditionalModel()\" value=\"繁\"/></li>";
	messageboxText += "</ul>";
	messageboxText += "<ul class=\"LanguageSpell\">";
	messageboxText += "<li class=\"barrierfree_btn01\" id=\"spell\"><input type=\"button\" title=\"显示拼音\" onclick=\"toolbar.Function.textTips.pinyinControl()\" value=\"拼音\"/></li>";
	messageboxText += "<li class=\"barrierfree_btn02\"><input type=\"button\" title=\"关闭文字放大阅读屏幕\" class=\"input\" onclick=\"toolbar.Function.textTips.mainMethod();\" onMouseDown=\"this.className='inputOn'\" onMouseUp=\"this.className=''\" value=\"关闭\"/></li>";
	messageboxText += "</ul>";
	messageboxText += "</div>";
	messageboxText += "<div class=\"Languagetext\">";
	messageboxText += "<div class=\"LanguageTextMin\">";
	messageboxText += "<div class=\"LanguageTextContent\">";
	messageboxText += "<p><table><tr><td id=\"helper_messageBoxText\"></td></tr></table></p>";
	messageboxText += "</div>";
	messageboxText += "</div>";
	messageboxText += "</div>";
	messageboxText += "<div class=\"disabilitiesFooterBg\"></div>";
	messageboxText += "</div>";

	toolbar.Function.textTips = {
		showHTML: function() {
			if (ABTConfig.textTips.functionSwitch) {
				return "<input id=\"texttipsbutton\" type=\"button\" value=\"文字提示\" title=\"文字提示\" onclick=\"toolbar.Function.textTips.mainMethod()\" /><!--<input id=\"pinyinbutton\" type=\"button\" value=\"开启拼音功能\" title=\"开启拼音功能\"onclick=\"toolbar.Function.textTips.pinyinControl()\" />-->";
			} else {
				return "";
			}
		},
		cookieName: "textTips",
		cookieMethod: function() {
			if (ABTConfig.textTips.cookieSwitch && toolbar.cookie.getCookie(this.cookieName) == 1) {
				toolbar.Function.textTips.mainMethod();
			}
		},
		resetCookie: function() {
			toolbar.cookie.setCookie(this.cookieName, 0);
		},
		testTipsState: false,
		pinyinState: false,
		allTextNode: new Array(),
		isTextNode: function(element) {
			if (element.tagName == "IMG" || element.tagName == "INPUT" || element.tagName == "OBJECT" || element.tagName == "SELECT" || element.tagName == "H1" || element.tagName == "H2" || element.tagName == "H3" || element.tagName == "H4" || element.tagName == "H5" || element.tagName == "H6" || element.tagName == "A" || element.tagName == "li" || element.tagName == "SPAN"|| element.tagName=="a" || element.tagName=="input"|| element.tagName=="img") {
				return true;
			} else {
				return false;
			}
		},
		getTextNode: function(element) {
			var childNodes = element.childNodes;
			for (var i = 0; i < childNodes.length; i++) {
				var thisChild = childNodes[i];
				switch (thisChild.nodeType) {
					case 1:
						this.getTextNode(thisChild);
						break;
					case 3:
						if (this.trim(thisChild.nodeValue).length == 0) {
							break;
						}
						this.allTextNode.push(thisChild);
						break;
				}
				if (thisChild.nodeName == "IMG" || thisChild.nodeName == "INPUT" || thisChild.nodeName == "OBJECT" || thisChild.nodeName == "SELECT") {
					this.allTextNode.push(thisChild);
				}
			}
		},
		AddTag: function() {
			if (this.firstRun) {
				return;
			}
			for (var a = 0; a < this.allTextNode.length; a++) {
				var tagNode = document.createElement(hiddenTagName);
				if (this.allTextNode[a].nodeName == "IMG" || this.allTextNode

					[a].nodeName == "INPUT" || this.allTextNode[a].nodeName == "SELECT") {
					tagNode.setAttribute("class", "getmessage");
					var newNode = this.allTextNode[a].cloneNode(true);
					tagNode.appendChild(newNode);
				} else if (this.allTextNode[a].nodeName == "OBJECT" && this.allTextNode[a].parentNode.nodeName != "OBJECT") {
					tagNode.setAttribute("class", "getmessage");
					var newNode = this.allTextNode[a].cloneNode(true);
					tagNode.appendChild(newNode);
				} else {
					var newString = this.allTextNode[a].nodeValue;
					var reg = /[，。！？；、：]/;
					if (true){//reg.exec(newString) == null) {
						tagNode.setAttribute("class", "getmessage");
						tagNode.innerHTML = newString;
					} else {
						tagNode.setAttribute("class", "getmainmessage");
						tagNode.innerHTML = this.mySplit(newString, /[，。！？；、：]/);
					}
				}
				if (this.allTextNode[a].parentNode) {
					this.allTextNode[a].parentNode.insertBefore(tagNode, this.allTextNode[a]);
				}
			}
			for (var b = 0; b < this.allTextNode.length; b++) {
				if(this.allTextNode[b].parentNode != null) {
					this.allTextNode[b].parentNode.removeChild(this.allTextNode[b]);
				}
			}
			var allOption = $(mainBoxID).get(0).getElementsByTagName("option");
			for (var c = 0; c < allOption.length; c++) {
				if(allOption[c].firstChild != null) {
					var thisMessage = allOption[c].firstChild.cloneNode(true);
					allOption[c].innerHTML = "";
					allOption[c].appendChild(thisMessage);
				}
			}
			this.firstRun = true;

		},
		trim: function(str) {
			return str.replace(/(^\s*)|(\s*$)/g, "");
		},
		mySplit: function(str, reg) {
			var result, x = str,
				y, zzz = true;
			var stringArray = new Array();
			do {
				result = reg.exec(x);
				if (result != null) {
					var stringIndex = result.index;
					stringArray.push(x.substring(0, stringIndex + 1));
					x = x.substring(stringIndex + 1);
				} else {
					stringArray.push(x)
					zzz = false;
				}
			}
			while (zzz)
			var yy = "<"+hiddenTagName + "class=\"getmessage\">";
			for (var a = 0; a < stringArray.length; a++) {
				yy += (a < stringArray.length - 1) ? (stringArray[a] + "</"+hiddenTagName+"><"+hiddenTagName+" class=\"getmessage\">") :

				(stringArray[a]);
			}
			yy += "</"+hiddenTagName+">";
			return yy;
		},
		pinyingArray: new Array(),
		TraditionalArray: new Array(),
		simplifiedArray: new Array(),
		makeMsgHTMLText: function(arrayText, arrayPinyin) {
			var htmlText = "";
			var CLOUM = 17;

			htmlText += "<table>";

			for (var k = 0; k <= arrayPinyin.length / CLOUM; k++) {
				htmlText += "<tr>";
				for (var i = 0; i + k * CLOUM < arrayPinyin.length && i < CLOUM; i++) {
					htmlText += "<td class=\"barrierfree_pinyin\">";
					htmlText += arrayPinyin[i + k * CLOUM];
					htmlText += "</td>";
				}
				htmlText += "</tr>";

				htmlText += "<tr>";
				for (var i = 0; i + k * CLOUM < arrayText.length && i < CLOUM; i++) {
					htmlText += "<td>";
					htmlText += arrayText[i + k * CLOUM];
					htmlText += "</td>";
				}
				htmlText += "</tr>";
			}

			htmlText += "</table>";

			return htmlText;
		},
		getTextNoParam:function() {
			toolbar.Function.textTips.getText(this);
		},
		getText: function(element) {
			var ele = element;
			if (!document.getElementById("helper_messageBoxText") || ele == null || ele.firstChild == null) {
				return;
			}
			var messagebox = document.getElementById("helper_messageBoxText");
			var textMessage = "";
			if (ele.firstChild.nodeName == "IMG") {

				if (ele.parentNode.parentNode.nodeName == "A" || ele.parentNode.nodeName == "A") {
					textMessage = "图片链接：" + getText(ele.firstChild);
				} else {
					textMessage = "图片：" + getText(ele.firstChild);
				}
			} else if (ele.firstChild.nodeName == "OBJECT") {
				textMessage = "媒体：" + ele.firstChild.getAttribute("title");
			} else if (ele.firstChild.nodeName == "SELECT") {
				textMessage = "下拉菜单";
			} else if (ele.firstChild.nodeName == "INPUT") {
				var inputType = ele.firstChild.getAttribute("type");
				switch (inputType) {
					case "button":
						textMessage = "表单按钮：" + ele.firstChild.getAttribute("value");
						break;
					case "image":
						textMessage = "图形按钮：" + ele.firstChild.getAttribute("alt");
						break;
					case "submit":
						textMessage = "提交按钮：" + ele.firstChild.getAttribute("value");
						break;
					case "reset":
						textMessage = "重置按钮：" + ele.firstChild.getAttribute("value");
						break;
					case "file":
						textMessage = "文件域：" + ele.firstChild.getAttribute("title");
						break;
					case "password":
						textMessage = "密码域：" + ele.firstChild.getAttribute("title");
						break;
					case "radio":
						textMessage = "单选框：" + ele.firstChild.getAttribute("title");
						break;
					case "checkbox":
						textMessage = "复选框：" + ele.firstChild.getAttribute("title");
						break;
					case "text":
						textMessage = "文本域：" + ele.firstChild.getAttribute("title");
						break;
				}
			} else if (ele.parentNode.parentNode.nodeName == "A" || ele.parentNode.nodeName == "A") {
				var thisContent;
				if (ele.parentNode.parentNode.nodeName == "A") {
					if (ele.parentNode.parentNode.getAttribute("title")) {
						thisContent = ele.parentNode.parentNode.getAttribute("title");
					} else {
						thisContent = ele.innerText || ele.textContent;
					}
				} else if (ele.parentNode.nodeName == "A") {
					if (ele.parentNode.getAttribute("title")) {
						thisContent = ele.parentNode.getAttribute("title");
					} else {
						thisContent = ele.innerText || ele.textContent;
					}
				}
				textMessage = "链接：" + thisContent;
			} else if (ele.parentNode.nodeName == "H1" || ele.parentNode.nodeName == "H2" || ele.parentNode.nodeName == "H3" || ele.parentNode.nodeName == "H4" || ele.parentNode.nodeName == "H5" || ele.parentNode.nodeName == "H6") {
				var thisContent = ele.innerText || ele.textContent;
				textMessage = "标题：" + thisContent;
			} else {
				//console.log("2:" + ele.innerHTML || ele.textContent);
				var thisContent = ele.innerText || ele.textContent;
				textMessage = "文本：" + thisContent;
			}
			var messageboxWidth = messagebox.offsetWidth;
			var fontRatio = messageboxWidth / textMessage.length;
			if (fontRatio < 30) {
				if (fontRatio > 18) {
					messagebox.style.fontSize = parseInt(fontRatio) + "px";
					messagebox.style.lineHeight = parseInt(fontRatio) + "px";
				}
				if (fontRatio < 10) {
					messagebox.style.fontSize = parseInt(fontRatio * 2) + "px";
					messagebox.style.lineHeight = parseInt(fontRatio * 2) + "px";
				}
			} else {
				messagebox.style.fontSize = "";
			}

			if (INSTANCE.pinYing == "1") {

				if (INSTANCE.isSimplifiedModel == "0") {
					toolbar.Function.textTips.pinyinText(textMessage);
					var traditionText = Traditionalized(textMessage);
					toolbar.Function.textTips.TraditionalArray = traditionText.split("");
					textMessage = toolbar.Function.textTips.makeMsgHTMLText(toolbar.Function.textTips.TraditionalArray, toolbar.Function.textTips.pinyingArray);

				} else {
					toolbar.Function.textTips.simplifiedArray = textMessage.split("");
					toolbar.Function.textTips.pinyinText(textMessage);
					textMessage = toolbar.Function.textTips.makeMsgHTMLText(toolbar.Function.textTips.simplifiedArray, toolbar.Function.textTips.pinyingArray);
				}

			} else {
				if (INSTANCE.isSimplifiedModel == "0") {
					textMessage = Traditionalized(textMessage);
				}
			}

			// 设置信息框内容
			messagebox.innerHTML = textMessage;
			textMessage = "";
			if (toolbar.Function.textTips.textbgState) {
				ele.style.backgroundColor = "#F00";
				ele.style.color = "#FFF";
			}
		},
		pinyinText: function(text) {
			var messayArray = text.split("");
			var newString = "";
			this.pinyingArray = new Array();
			for (var a = 0; a < messayArray.length; a++) {
				var testVar = "";
				if (pinyin[messayArray[a]]) {
					testVar = pinyin[messayArray[a]];
				} else {
					testVar = "&nbsp;";
				}
				if (messayArray[a] == " ") {
					messayArray[a] = "&nbsp;";
				}
				this.pinyingArray.push(testVar);
			}
			return newString;
		},
		getEvent: function() {
			var allSpan = $(mainBoxID).find('.getmessage');
			var mouseOver = this.getTextNoParam;
			var mouseOut = this.clearTextbgNoParam;
			//alert(allSpan.size());
			allSpan.each(function() {
				$(this).on('mouseover', mouseOver).on('mouseout', mouseOut);
			});

			// 设置iframe样式
			var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
			if (!iframeNode) {
				return;
			}
			for (var i = 0; i < iframeNode.length; i++) {
				var iframeObject = iframeNode[i].contentWindow;
				this.addEventForIframe(iframeObject);
			}
		},
		addEventForIframe: function(iframeObject) {
				try {
					var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
					for (var j = 0; j < iFrameAllNode.length; j++) {
						var element = iFrameAllNode[j];
						if(element.tagName == 'iframe' || element.tagName == 'IFRAME') {
							this.addEventForIframe(element.contentWindow);
						}else if (this.isTextNode(element)) {

							var value 			= new elementContext();
							value.thisContext 	= this;
							value.funcMouseOver = element.onmouseover;
							value.funcMouseOut 	= element.onmouseout;
							value.element 		= element;
							elementFuncHashMap.put(hex_md5(element.innerHTML),value);

							element.onmouseout = function() {

							    var context = elementFuncHashMap.get(hex_md5(this.innerHTML));
							    if (context && typeof(context.funcMouseOut) == 'function') {
							        context.funcMouseOut();
							    }
							    if(context) {
							    	context.thisContext.clearTextbg(this);
							    } else {
							    	//alert(hex_md5(this.innerHTML));	
							    }
							}

							element.onmouseover = function() {
							    var context = elementFuncHashMap.get(hex_md5(this.innerHTML));
							    if (context && typeof(context.funcMouseOver) == 'function') {
							        context.funcMouseOver();
							    }
							    if(context) {
							    	context.thisContext.getText(this);
							    } else {
							    }
							}
						}
					}
				} catch (e) {}
		},

		simpleModel: function() {
			INSTANCE.isSimplifiedModel = INSTANCE.isSimplifiedModel = "1";
		},
		raditionalModel: function() {
			INSTANCE.isSimplifiedModel = INSTANCE.isSimplifiedModel = "0";
		},
		pinyinControl: function() {
			INSTANCE.pinYing = INSTANCE.pinYing == "0" ? "1" : "0";
		},
		firstRun: false,
		textbgState: false,
		textbg: function() {
			this.textbgState = this.textbgState ? false : true;
			document.getElementById("textbgbuttonbox").getElementsByTagName("a")[0].innerHTML =

			this.textbgState ? "关闭标记功能" : "开启标记功能";
		},
		clearTextbgNoParam: function() {
			toolbar.Function.textTips.clearTextbg(this);
		},
		clearTextbg: function(element) {
			var ele = element || this;
			ele.style.backgroundColor = "";
			ele.style.color = "";
		},
		mainMethod: function() {
			if (!this.textGetState) {

				if ($("#gettextmessagebox").size() > 0) {

					this.textGetState = true;
					document.body.style.paddingBottom = 160 + "px";

					$("#gettextmessagebox").show();
					foldToolBar();
					//toggleMsgBoxBtn();
					$("#barrierfree_btn01").get(0).focus();
					return;
				}
				var newMessageBox = document.createElement("div");
				newMessageBox.setAttribute("id", "gettextmessagebox");
				newMessageBox.innerHTML = messageboxText;
				document.body.insertBefore(newMessageBox, $(mainBoxID).get(0));
				document.body.style.paddingBottom = 160 + "px";
				document.body.style.width = "100%";
				document.body.style.float = "none";
				this.getTextNode($(mainBoxID).get(0));

				this.AddTag();
				this.getEvent();
				this.textGetState = true;
				bindMessageBoxJS();
				foldToolBar();
				//toggleMsgBoxBtn();
				$("#barrierfree_btn01").get(0).focus();
			} else {
				$("#gettextmessagebox").hide();
				document.body.style.paddingBottom = 0 + "px";
				document.body.style.overflow = "";
				this.textGetState = false;
				//toggleMsgBoxBtn();
				$("#screen").get(0).focus();
			}
			INSTANCE.textTips = this.textGetState ? "1" : "0";
			SetCookie("textTips", this.textGetState ? "1" : "0");
		},
		getIframeTextNode: function() {
			// 设置iframe样式
			var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
			if (!iframeNode) {
				return;
			}
			for (var i = 0; i < iframeNode.length; i++) {
				var iframeObject = iframeNode[i].contentWindow;
				try {
					var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0];
					this.getTextNode(iFrameAllNode);
				} catch (e) {
				//alert(e);
				}
			}
		}
	}
}
//---------------------------文字提示定义结束-----------------------------//

//---------------------------页面js定义开始-----------------------------//
var toolBarFoldFlag = 0;
var openMsgBoxFlag = 0;

function toggleMsgBoxBtn() {
	if (openMsgBoxFlag == 0) {
		openMsgBox();
	} else {
		closeMsgBox();
	}
}

function openMsgBox() {
	openMsgBoxFlag = 1;
	$("#txt").addClass('active').attr('title', '转换成图文模式');
}

function closeMsgBox() {
	openMsgBoxFlag = 0;
	$("#txt").removeClass('active').attr('title', '转换成纯文本模式');
}

function bindPageJS() {
	// 绑定页面对比度效果脚本
	doorList('tab');
	doorList('language');
	doorList('txt');

	// 按钮悬停
	$('.barrierfree_btn').hover(
		function() {
			$(this).addClass('hover');
		},
		function() {
			$(this).removeClass('hover');
		}	
	);

	// 颜色选择点击按钮
	$('#selectcolor .barrierfree_btn').click(function() {
		$('#selectcolor .barrierfree_btn.active').removeClass('active');
		$(this).addClass('active');
	});

	$("#line,#txt").toggle(function() {
		$(this).addClass('active');
	},
	function() {
		$(this).removeClass('active');
	});

	$("#fold").click(function() {
		if (toolBarFoldFlag == 0) {
			foldToolBar();
		} else {
			unfoldToolBar();
		}
	});
}

// 折叠顶部工具条

function foldToolBar() {
	$("#fold").get(0).setAttribute("title", "展开工具条");
	$(".disabilitiesNav").attr('class', 'disabilitiesNavFold');
	toolBarFoldFlag = 1;
	document.body.style.paddingTop = '0px'; //wcagNavDiv.get(0).offsetHeight + "px";
}
// 折叠顶部工具条

function unfoldToolBar() {
	$("#fold").get(0).setAttribute("title", "折叠工具条");
	$(".disabilitiesNavFold").attr('class', 'disabilitiesNav');
	toolBarFoldFlag = 0;
	document.body.style.paddingTop = '34px';
}

// 初始化文字提示框界面

function bindMessageBoxJS() {
	doorList('language');

	$("#spell").toggle(function() {
		$(this).attr('class', 'barrierfree_open')
	},
	function() {
		$(this).attr('class', 'barrierfree_close')
	});
}

function doorList(id) {
	var curentId = 0;
	$("#" + id + " .font_titleBar li:eq(0)").addClass("disabilitiesNow");
	$("#" + id + " .door:eq(0)").show();
	$("#" + id + " .font_titleBar li").click(function() {
		if ($(this).attr('class') == 'link') {
			return;
		}
		if (curentId != $(this).index()) {
			curentId = $(this).index();
			var curentDiv = $("#" + id + " div div.door").eq(curentId);
			var curentHeight = $(curentDiv).height();
			$("#" + id + " .font_titleBar li").removeClass("disabilitiesNow");
			$(this).addClass("disabilitiesNow");

		};
	});
}
//---------------------------页面js定义结束-----------------------------//


function initBarrierFreeEvent() {
	addKeyListenerToIframe();
}
// 初始化工具模块

function initBarrierFree() {
	debug("initBarrierFree");
	declareConfig();
	mainBoxID = "#" + BarrierFreeConfig.mainBox;
	// 初始化
	initTextTips();
	initData();
	debug(toolbar.Function.textTips);
	// 监听事件
	initKeyEventListener();
	// 恢复上次状态
	setTimeout(restoreStatus, 1000);
}
//------------------------------------------------------------------------------------
//--------------------------------------主方法开始结束-----------------------------------

// 初始化数据

function initData() {
	INSTANCE.openFlag = getCookie("openFlag");
	if (!INSTANCE.openFlag) {
		INSTANCE.openFlag = "0";
	}
	INSTANCE.textFlag = getCookie("textFlag");
	//if (!INSTANCE.textFlag) {
	INSTANCE.textFlag = "0";
	//}
	INSTANCE.zoomValue = parseInt(getCookie("zoomValue"));
	debug("INSTANCE.zoomValue:" + INSTANCE.zoomValue);
	if (INSTANCE.zoomValue > 2 || INSTANCE.zoomValue <= 0 || isNaN(INSTANCE.zoomValue)) {
		INSTANCE.zoomValue = 1;
	}
	INSTANCE.fontValue = parseInt(getCookie("fontValue"));
	//if (INSTANCE.fontValue > 32 || INSTANCE.fontValue < 16 || isNaN(INSTANCE.fontValue)) {
	INSTANCE.fontValue = 16;
	//}
	INSTANCE.colorFlag = getCookie("colorFlag");
	if (!INSTANCE.colorFlag) {
		INSTANCE.colorFlag = "0";
	}
	INSTANCE.lineFlag = getCookie("lineFlag");
	if (!INSTANCE.lineFlag) {
		INSTANCE.lineFlag = "0";
	}
	INSTANCE.textTips = getCookie("textTips");
	if (!INSTANCE.textTips) {
		INSTANCE.textTips = "0";
	}

	INSTANCE.isSimplifiedModel = getCookie("isSimplifiedModel");
	if (!INSTANCE.isSimplifiedModel) {
		INSTANCE.isSimplifiedModel = "1";
	}
	INSTANCE.pinYing = getCookie("pinYing");
	if (!INSTANCE.pinYing) {
		INSTANCE.pinYing = "0";
	}
	INSTANCE.browser = browserFlag();
}

// 恢复到上次的状态

function restoreStatus() {
    $.fn.extend({
        toggle: function (fn1, fn2) {
            $(this).bind("click", function () {
                if ($(this).attr("lsfAlreadyToggle") && $(this).attr("lsfAlreadyToggle") == "1") {
                    $(this).attr("lsfAlreadyToggle", "0");
                    if (fn2)
                        fn2.call(this);
                    else
                        $(this).show();
                }
                else {
                    $(this).attr("lsfAlreadyToggle", "1");
                    if (fn1)
                        fn1.call(this);
                    else
                        $(this).hide();
                }
            });
        }
    });
	//工具条初始化	
	if (INSTANCE.openFlag == "1" || (typeof(BarrierFreeConfig.AutoOpen) != "undefined") && (BarrierFreeConfig.AutoOpen == "1")) {
		openToolBar();
	}
	debug("INSTANCE.openFlag:" + INSTANCE.openFlag);
}

// 监听key事件

function initKeyEventListener() {
	// 事件监听
	document.onkeydown = function KeyDownEvent(e) {
		//快捷键获取
		var currkey = 0,
			e = e || event || window.event;
		currkey = e.keyCode || e.which || e.charCode;
		//快捷键键盘监听
		accessKeyboardListener(currkey, e);
		//工具条键盘监听
		toolBarKeyDownEvent(currkey, e);
	}
}
/*
 * 控制打开／关闭辅助工具条
 */

function toggleToolBar() {
	var pathname = window.location.pathname;
	var path;
	if (!Array.prototype.indexOf)
	{
	  Array.prototype.indexOf = function(elt /*, from*/)
	  {
	    var len = this.length >>> 0;
	    var from = Number(arguments[1]) || 0;
	    from = (from < 0)
	         ? Math.ceil(from)
	         : Math.floor(from);
	    if (from < 0)
	      from += len;
	    for (; from < len; from++)
	    {
	      if (from in this &&
	          this[from] === elt)
	        return from;
	    }
	    return -1;
	  };
	}
	if(pathname.indexOf("/view/")!=-1){
		path = pathname.substr(0,pathname.indexOf("/web")) + "/module/jslib/accessiblereading/css/barrierfree.css";
//		if(pathname.indexOf("col")!=-1){
//			path = "../../../module/accessiblereading/css/barrierfree.css";
//		}else if(pathname.indexOf("art")!=-1){
//			path = "../../../../../module/accessiblereading/css/barrierfree.css";
//		}else{
//			path = "../module/accessiblereading/css/barrierfree.css";
//		}
	}else{
		path = "/module/jslib/accessiblereading/css/barrierfree.css";
//		if(pathname.indexOf("col")!=-1){
//			path = "../../module/accessiblereading/css/barrierfree.css";
//		}else if(pathname.indexOf("art")!=-1){
//			path = "../../../../module/accessiblereading/css/barrierfree.css";
//		}else{
//			path = "module/accessiblereading/css/barrierfree.css";
//		}
	}
	$('body').append('<link href="'+path+'" rel="stylesheet" type="text/css" />');

	if(!checkValid()) {
		return;
	}
	if (INSTANCE.openFlag == "0") {
		openToolBar();
		INSTANCE.openFlag = "1";
		SetCookie("openFlag", "1");
	} else {
		INSTANCE.openFlag = "0";
		SetCookie("openFlag", "0");
		closeToolBar();
		setTimeout(resetNavToolbar, 1000);
		//resetNavToolbar();
	}
}
function checkValid() {
	var host = document.domain;
	if(1) {
		return true;
		}
	else {
		return true;
	}
}
/*
 * 打开辅助工具条
 */

function openToolBar() {

	var wcagNavDiv = $("#wcagnav");
	if (wcagNavDiv.size() == 0) {
		creatWcagNav();
		wcagNavDiv = $("#wcagnav");
	}

	wcagNavDiv.show(1000, function() {
		wcagNavDiv.get(0).style.display = "block";
		document.body.style.paddingTop = wcagNavDiv.get(0).offsetHeight + "px";
	});

	INSTANCE.openFlag == "1";
	SetCookie("openFlag", "1");


	if (toolbar.Function.textTips.textGetState == true) {
		$("#gettextmessagebox").show();
	}
	createNodeDiv("wcagnav", "工具条已开启,帮助请按ALT+1");
}

/*
 * 关闭辅助工具条
 */

function closeToolBar() {
	var wcagNavDiv = $("#wcagnav");
	wcagNavDiv.hide(1000, function() {
		wcagNavDiv.get(0).style.display = "none";
		document.body.style.paddingTop = wcagNavDiv.get(0).offsetHeight + "px";
	});

	$("#gettextmessagebox").hide();
	createNodeDiv("wcagnav", "工具条已关闭");
}

/*
 * 创建辅助工具条
 */

function creatWcagNav() {

	var toolbarinnerText = getToolbarInnerText();

	//工具条创建
	var navToolbarDiv = document.createElement("div");
	navToolbarDiv.setAttribute("id", "wcagnav");
	navToolbarDiv.style.display = "none";
	navToolbarDiv.innerHTML = toolbarinnerText;
	document.body.insertBefore(navToolbarDiv, document.body.firstChild);

	// 绑定页面效果脚本
	bindPageJS();
}

function getToolbarInnerText() {

	var textHTML = "";
	// 顶部区域
	textHTML += "<div class=\"disabilitiesNav\">";
        // 解决ie6下拉框浮在工具条上的方法
        textHTML += "<iframe style=\"position:absolute;top:0;left:0;width:100%;height:100%;z-index:-1;filter:alpha(opacity=0);\"></iframe>";
	textHTML += "<div class=\"disabilitiesMain\"  id=\"tab\">";
	textHTML += "<div class=\"disabilitiesContent\">";
	
	textHTML += "<div class=\"barrierfree_logo\"></div>";

	textHTML += "<div class=\"btn_group\">";
	textHTML += "<div id=\"barrierfree_zoom_in\" class=\"barrierfree_btn btn_big btn_01\" onclick=\"openPageFunction(0);\" title=\"放大\"></div>";
	textHTML += "<div id=\"barrierfree_zoom_out\" class=\"barrierfree_btn btn_big btn_02\" onclick=\"openPageFunction(1);\" title=\"缩小\"></div>";
	textHTML += "</div>";

	
	textHTML += "<div id=\"selectcolor\" class=\"btn_group\">";
	textHTML += "<div class=\"barrierfree_tr\">";
	textHTML += "<div class=\"barrierfree_btn btn_small btn_03\" onclick=\"asySetColorFunction('1');\" title=\"蓝底黄字\"></div>";
	textHTML += "<div class=\"barrierfree_btn btn_small btn_04\" onclick=\"asySetColorFunction('2');\" title=\"黄底蓝字\"></div>";
	textHTML += "<div class=\"barrierfree_btn btn_small btn_05\" onclick=\"asySetColorFunction('3');\" title=\"黑底黄字\"></div>";
	textHTML += "<div class=\"barrierfree_btn btn_small btn_06\" onclick=\"asySetColorFunction('4');\" title=\"白底黑子\"></div>";
	textHTML += "</div>";
	textHTML += "<div class=\"barrierfree_btn btn_long btn_07\" onclick=\"asySetColorFunction('0');\" title=\"还原默认\"></div>";
	textHTML += "</div>";

	textHTML += "<div class=\"btn_group\">";
	textHTML += "<div id=\"txt\" class=\"barrierfree_btn btn_big btn_08\" onclick=\"openTextFunction();\" title=\"转换成纯文本模式\"></div>";
	textHTML += "<div id=\"screen\" class=\"barrierfree_btn btn_big btn_09\" onclick=\"toolbar.Function.textTips.mainMethod();\" title=\"文字放大浏览\"></div>";
	textHTML += "<div id=\"line\" class=\"barrierfree_btn btn_big btn_10\" onclick=\"openLineFunction()\" title=\"辅助线\"></div>";
	textHTML += "</div>";

	textHTML += "<div class=\"btn_group\">";
	textHTML += "<div class=\"barrierfree_btn btn_half btn_11\" onclick=\"resetNavToolbar();\" title=\"重置\"></div>";
	textHTML += "<div id=\"fold\" class=\"barrierfree_btn btn_half btn_12\" title=\"折叠\"></div>";
	textHTML += "</div>";

	textHTML += "<div class=\"btn_group\">";
	textHTML += "<div class=\"barrierfree_btn btn_big btn_13\" onclick=\"navToolbarHelp();\" title=\"帮助\"></div>";
	textHTML += "</div>";

	textHTML += "<div class=\"btn_close\" onclick=\"toggleToolBar();\" title=\"关闭\"></div>";

	textHTML += "</div>";
	textHTML += "</div>";
	textHTML += "<div class=\"disabilitiesTopBg\"></div>";
	textHTML += "</div>";

	return textHTML;
}

//---------------------------纯文本通道功能开始------------------------//
//执行函数

function openTextFunction() {
	if (INSTANCE.textFlag == "0") {
		textFunction();
		// 取消页面放大
		pageFunction(1);

		INSTANCE.textFlag = "1";
		SetCookie("textFlag", "1");

		//$("#barrierfree_zoom_in").get(0).setAttribute("title","放大文字");
		//$("#barrierfree_zoom_out").get(0).setAttribute("title","缩小文字");

		// 设置对比色
		if (INSTANCE.colorFlag != "0") {
			asyDoSetColorFunction(INSTANCE.colorFlag);
		}
	} else {
		//navgationIframeBack();
		INSTANCE.textFlag = "0";
		SetCookie("textFlag", "0");
		resetNavToolbar();
		//window.location.href = window.location.href;
		//window.location.reload();
	}
}
//纯文本功能实现

function textFunction() {
	//navgationIframe();
	changeiFrame();
	changeImage();
	changeStyle();
}
//替换、清除页面样式

function changeStyle() {
	//替换样式
	var linkStyle = document.getElementsByTagName("link");
	for (i = 0; i < linkStyle.length; i++) {
		if (linkStyle[i].getAttribute("href").indexOf(BarrierFreeConfig.HtmlToolCssUrl) == -1
		&& linkStyle[i].getAttribute("href").indexOf(BarrierFreeConfig.TextToolCssUrl) == -1) {
			linkStyle[i].setAttribute("href", BarrierFreeConfig.TextModeCssUrl);
		}
	}
	//清除页面样式
	var allNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("*");
	for (var j = 0; j < allNode.length; j++) {
		allNode[j].style.cssText = "";
	}
	for (var k = 0; k < allNode.length; k++) {
		allNode[k].style.height = "auto";
	}
}
//用文字替换页面图片

function changeImage() {
	var allImage = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("img");
	var length = allImage.length;
	for (i = 0; i < allImage; i++) {
		var allImageAlt = allImage[i].getAttribute("alt");
		if (allImageAlt == "" || allImageAlt == null) {
			allImageAlt = allImage[i].getAttribute("title");
		}
		var newImageNode = document.createElement("span");
		newImageNode.innerHTML = allImageAlt;
		allImage[i].parentNode.insertBefore(newImageNode, allImage[i]);
	}
	while (allImage.length) {
		allImage[0].parentNode.removeChild(allImage[0]);
	}
}
//处理页面中的iframe

function changeiFrame() {
	var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
	if (!iframeNode) {
		return;
	}

	var length = iframeNode.length;
	for (var i = 0; i < length; i++) {
		var iframeObject = iframeNode[i].contentWindow;
		try {
			var iFrameHTML = iframeObject.document.body.innerHTML;
			var divForiFrame = document.createElement("div");
			divForiFrame.setAttribute("id", "iframeDiv_" + i);
			divForiFrame.innerHTML = iFrameHTML;
			iframeNode[i].parentNode.insertBefore(divForiFrame, iframeNode[i]);
		} catch (e) {}
	}
	while (iframeNode.length) {
		iframeNode[0].parentNode.removeChild(iframeNode[0]);
	}
}

//---------------------------纯文本通道功能结束------------------------//
//---------------------------页面缩放功能开始--------------------------//
//执行函数

function openPageFunction(flag) {

	// 文字模式下 变为缩放文字
	if (INSTANCE.textFlag == "1") {
		openFontFunction(flag);
		return;
	}

	if (flag == "0") {
		INSTANCE.zoomValue = INSTANCE.zoomValue + 0.2;
		if (INSTANCE.zoomValue > 2) {
			INSTANCE.zoomValue = 2;
		}
	} else {
		INSTANCE.zoomValue = INSTANCE.zoomValue - 0.2;
		if (INSTANCE.zoomValue < 1) {
			INSTANCE.zoomValue = 1;
		}
	}
	debug("INSTANCE.zoomValue:" + INSTANCE.zoomValue);
	SetCookie("zoomValue", INSTANCE.zoomValue);
	pageFunction(INSTANCE.zoomValue);
}
//缩放功能实现

var rabitPx = 1;
function pageFunction(value) {
	debug("pageFunction 1");
	if(rabitPx == 1) {
	    rabitPx = 0;
	} else {
		rabitPx = 1;
	}

	//console.log("zoom scale:" + value);
	if (value == 1) {
		//window.location.href = window.location.href;
		//window.location.reload();
		//return;
	}
	if (INSTANCE.browser.safari || INSTANCE.browser.chrome) {
		$(mainBoxID).css({
			"-webkit-transform-origin": "top left",
			"-webkit-transform": "scale(" + value + ")",
			"padding":rabitPx +"px"
		});
		//document.getElementById(mainBox).style.cssText = "-webkit-transform-origin:top left;-webkit-transform:scale(" + value + ")";
	} else if (INSTANCE.browser.firefox) {
		$(mainBoxID).css({
			"-moz-transform-origin": "top left",
			"-moz-transform": "scale(" + value + ")",
			"padding":rabitPx +"px"
		});
		//document.getElementById(mainBox).style.cssText = "-moz-transform-origin:top left;-moz-transform:scale(" + value + ")";
	} else if (INSTANCE.browser.opera) {
		$(mainBoxID).css("-o-transform:scale(" + value + ")");
		//document.getElementById(mainBox).style.cssText = "-o-transform:scale(" + value + ")";
	} else {
		if (document.body.offsetWidth > document.getElementById(BarrierFreeConfig.mainBox).offsetWidth * value) {
			document.getElementById(BarrierFreeConfig.mainBox).style.cssText = "position:absolute;margin:0px;";
			//document.getElementById(BarrierFreeConfig.mainBox).style.marginLeft = 0 - Math.round(document.getElementById(BarrierFreeConfig.mainBox).offsetWidth * value / 2) + "px";
			document.getElementById(BarrierFreeConfig.mainBox).style.marginLeft = (document.body.offsetWidth - Math.round(document.getElementById(BarrierFreeConfig.mainBox).offsetWidth * value)) / 2 + "px";
		} else {
			$(mainBoxID).css("position:absolute;margin:0px;");
			document.getElementById(BarrierFreeConfig.mainBox).style.cssText = "position:absolute;margin:0px;";
		}
		//$(mainBoxID).css("room:" + value);
		document.getElementById(BarrierFreeConfig.mainBox).style.zoom = value;
	}

	//console.log("zoom scale:" + value);
}
//---------------------------页面缩放功能结束--------------------------//
//---------------------------文字缩放功能结束----------------------------//

function openFontFunction(flag) {
	debug("fontFunction 1");
	if (flag == "0") {
		INSTANCE.fontValue = parseInt(INSTANCE.fontValue) + 4;
		if (INSTANCE.fontValue > 32) {
			INSTANCE.fontValue = 32;
		}
	} else {
		INSTANCE.fontValue = parseInt(INSTANCE.fontValue) - 4;
		if (INSTANCE.fontValue < 16) {
			INSTANCE.fontValue = 16;
		}
	}
	SetCookie("fontValue", INSTANCE.fontValue);
	fontFunction(INSTANCE.fontValue);
}
//文字缩放功能实现

function fontFunction(sizeValue) {

	if (sizeValue == 16) {
		$(mainBoxID).css({
			"fontSize": "",
			"lineHeight": "",
			"height": ""
		});

		$("table").css({
			"fontSize": "",
			"lineHeight": "",
			"height": ""
		});

		// 设置iframe样式
		var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
		if (!iframeNode) {
			return;
		}
		for (var i = 0; i < iframeNode.length; i++) {
			var iframeObject = iframeNode[i].contentWindow;
			try {
				var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
				iframeObject.document.getElementsByTagName("body")[0].style.fontSize = "";
				iframeObject.document.getElementsByTagName("body")[0].style.lineHeight = "";
				iframeObject.document.getElementsByTagName("body")[0].style.height = "";
				for (var j = 0; j < iFrameAllNode.length; j++) {
					iFrameAllNode[j].style.fontSize = "";
					iFrameAllNode[j].style.lineHeight = "";
					iFrameAllNode[j].style.height = "";
				}
			} catch (e) {}
		}

	} else {

		$("table").css({
			"fontSize": sizeValue + "px",
			"lineHeight": "1.8em", //(parseInt(sizeValue) + 2) + "px",
			"height": "auto"
		});

		$(mainBoxID).css({
			"fontSize": sizeValue + "px",
			"lineHeight": "1.8em", //(parseInt(sizeValue) + 2) + "px",
			"height": "auto"
		});

		// 设置iframe样式
		var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
		if (!iframeNode) {
			return;
		}
		for (var i = 0; i < iframeNode.length; i++) {
			var iframeObject = iframeNode[i].contentWindow;
			try {
				var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
				iframeObject.document.getElementsByTagName("body")[0].style.fontSize = sizeValue + "px";
				iframeObject.document.getElementsByTagName("body")[0].style.lineHeight = (parseInt(sizeValue) + 2) + "px";
				iframeObject.document.getElementsByTagName("body")[0].style.height = "auto";
				for (var j = 0; j < iFrameAllNode.length; j++) {
					iFrameAllNode[j].style.fontSize = sizeValue + "px";
					iFrameAllNode[j].style.lineHeight = "1.8em", //(parseInt(sizeValue) + 2) + "px",
					iFrameAllNode[j].style.height = "auto";
				}
			} catch (e) {}
		}
	}
}
//---------------------------文字缩放功能结束----------------------------//

//---------------------------对比度功能开始----------------------------//
//执行函数

function setColorFunction() {
	var mode = parseInt(INSTANCE.colorFlag);
	switch (mode) {
		case 0:
			changeColorStyle("", "", "");
			break;
		case 1:
			changeColorStyle("#0000ff", "none", "#ffff00");
			break;
		case 2:
			changeColorStyle("#fefecc", "none", "#0000ff");
			break;
		case 3:
			changeColorStyle("#000000", "none", "#ffff00");
			break;
		case 4:
			changeColorStyle("#ffffff", "none", "#000000");
			break;

		default:
			break;
	}
}

function asyDoSetColorFunction(mode) {
	INSTANCE.colorFlag = mode;
	SetCookie("colorFlag", mode);

	setTimeout(setColorFunction, 10);
}

function asySetColorFunction(mode) {
	if (INSTANCE.colorFlag === mode)
		return;

	asyDoSetColorFunction(mode);
}

function changeColorStyle(bgColor, bgImage, color) {
	$(mainBoxID).find("*:not(#wcagnav)").css({
		"backgroundColor": bgColor,
		"backgroundImage": bgImage,
		"color": color
	});


	// 设置iframe样式
	var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
	if (!iframeNode) {
		return;
	}
	for (var i = 0; i < iframeNode.length; i++) {
		var iframeObject = iframeNode[i].contentWindow;
		changeIframeColor(bgColor,bgImage,color,iframeObject);
	}
}

function changeIframeColor(bgColor, bgImage, color, iframeObject) {
	try {
			var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
			iframeObject.document.getElementsByTagName("body")[0].style.backgroundColor = bgColor;
			iframeObject.document.getElementsByTagName("body")[0].style.backgroundImage = bgImage;
			iframeObject.document.getElementsByTagName("body")[0].style.color = color;
			for (var j = 0; j < iFrameAllNode.length; j++) {
				if(iFrameAllNode[j].tagName == 'iframe' || iFrameAllNode[j].tagName=='IFRAME') {
					changeIframeColor(bgColor,bgImage,color,iFrameAllNode[j].contentWindow);
				} else {
					iFrameAllNode[j].style.backgroundColor = bgColor;
					iFrameAllNode[j].style.backgroundImage = bgImage;
					iFrameAllNode[j].style.color = color;
				}
			}
		} catch (e) {
		}
}

function openColorFunction() {
	debug("openColorFunction 1");
	if (INSTANCE.colorFlag == "0") {

		colorFunction();

		INSTANCE.colorFlag = "1";
		SetCookie("colorFlag", "1");

		debug("open color function");

	} else {

		closeColorFunction();

		INSTANCE.colorFlag = "0";
		SetCookie("colorFlag", "0");

		debug("close color function");
	}
}

function closeColorFunction() {
	debug("closeColorFunction start");

	iframeClearColorFunction();
	$(mainBoxID).find("*:not(:#wcagnav)").css({
		"backgroundColor": "",
		"backgroundImage": "",
		"color": ""
	});
	debug("closeColorFunction end");
}
//高对比度功能实现

function colorFunction() {

	debug("colorFunction 1");

	iframeColorFunction();
	$(mainBoxID).find("*:not(:#wcagnav)").css({
		"backgroundColor": "#000",
		"backgroundImage": "none",
		"color": "#FFF"
	});
}

//iframe对比度处理

function iframeColorFunction() {
	var iframeNode = document.getElementsByTagName("iframe");
	if (!iframeNode) {
		return;
	}
	for (var i = 0; i < iframeNode.length; i++) {
		var iframeObject = iframeNode[i].contentWindow;
		try {
			var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
			iframeObject.document.getElementsByTagName("body")[0].style.backgroundColor = "#000";
			iframeObject.document.getElementsByTagName("body")[0].style.backgroundImage = "none";
			iframeObject.document.getElementsByTagName("body")[0].style.color = "#FFF";
			for (j = 0; j < iFrameAllNode.length; j++) {
				iFrameAllNode[j].style.backgroundColor = "#000";
				iFrameAllNode[j].style.backgroundImage = "none";
				iFrameAllNode[j].style.color = "#FFF";
			}
		} catch (e) {}
	}
}

// iframe 去掉高对比度

function iframeClearColorFunction() {
	var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
	if (!iframeNode) {
		return;
	}
	for (var i = 0; i < iframeNode.length; i++) {
		var iframeObject = iframeNode[i].contentWindow;
		try {
			var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
			iframeObject.document.getElementsByTagName("body")[0].style.backgroundColor = "";
			iframeObject.document.getElementsByTagName("body")[0].style.backgroundImage = "";
			iframeObject.document.getElementsByTagName("body")[0].style.color = "";
			for (j = 0; j < iFrameAllNode.length; j++) {
				iFrameAllNode[j].style.backgroundColor = "";
				iFrameAllNode[j].style.backgroundImage = "";
				iFrameAllNode[j].style.color = "";
			}
		} catch (e) {}
	}
}
//---------------------------对比度功能结束----------------------------//

//---------------------------辅助线功能开始---------------------------//
//辅助线执行函数

function openLineFunction() {
	debug("openLineFunction 1 :" + INSTANCE.lineFlag);
	if (INSTANCE.lineFlag == "0") {
		INSTANCE.lineFlag = "1";
		lineFunction();

		//SetCookie("lineFlag", "1");
	} else {

		document.getElementById('lineX').style.display = 'none';
		document.getElementById('lineY').style.display = 'none';
		document.onmousemove = "";

		INSTANCE.lineFlag = "0";
		//SetCookie("lineFlag", "0");
	}
}
//辅助线功能实现，辅助线移动工具:页面出现2条辅助功能线，用来从水平和垂直两方面校对页面文本。

function lineFunction() {
	debug("lineFunction 1");
	//初始化辅助线
	var lineDivHTML = "<div id=\"lineX\" style=\"border-top:5px red solid;position:absolute;width:100%;height:4px;left:0px;top:0px;font-size:0px;line-height:0px;z-index:99999;\"></div>";
	lineDivHTML = lineDivHTML + "<div id=\"lineY\" style=\"border-left:5px red solid;position:absolute;width:4px;height:100%;top:0px;font-size:0px;line-height:0px;z-index:99998;\"></div>";

	var lineDiv = document.getElementById("lineDiv");
	if (!lineDiv) {
		lineDiv = document.createElement("div");
		lineDiv.setAttribute("id", "lineDiv");
		lineDiv.setAttribute("style", "width:100%;height:0px;line-height:0px;font-size:0px;top:0px;left:0px;");
		lineDiv.innerHTML = lineDivHTML;
		document.body.insertBefore(lineDiv, document.body.firstChild);
	}

	document.getElementById('lineX').style.display = 'block';
	document.getElementById('lineY').style.display = 'block';
	debug("onmousemove");
	document.onmousemove = mouseLineMove;
	//$("html").bind("mousemove", mouseLineMove);
	//$("iframe").bind("mousemove", mouseLineMove);
	setIframeOnMouseMoveEevent();
}

function setIframeOnMouseMoveEevent()
{
	var iframeNode = document.getElementById(BarrierFreeConfig.mainBox).getElementsByTagName("iframe");
	if (!iframeNode) {
		return;
	}
	for (var i = 0; i < iframeNode.length; i++) {
		//alert("count:"+iframeNode.length + "/" + i);
		var iframeObject = iframeNode[i].contentWindow;
		bindOnMouseEvent(iframeObject);
	}
} 
function bindOnMouseEvent(iframeObject)
{
	try {
		iframeObject.document.onmousemove = mouseIframeLineMove;
		var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
		for (var j = 0; j < iFrameAllNode.length;j++ ) {
			if(iFrameAllNode[j].tagName == 'iframe' || iFrameAllNode[j].tagName=='IFRAME') {
				//alert(iFrameAllNode[j].tagName +" " + j + " count:" + iFrameAllNode.length);
				var innerIframeObject = iFrameAllNode[j].contentWindow;
				bindOnMouseEvent(innerIframeObject);
			}
		}
	} catch (e) {}
}

//当前鼠标位置判断
var browserToolBarHeight = 0;
function mouseLineMove(e) {
	//console.log(e.screenX + "  Y:" + e.screenY);
	e = e || event || window.event;
	var lineValueX = e.pageX;
	var lineValueY = e.pageY;

	if (!lineValueX && !lineValueY) {
		lineValueX = e.clientX;
		lineValueY = e.clientY + (document.documentElement.scrollTop || document.body.scrollTop);
	}

	document.getElementById('lineX').style.top = lineValueY + 5 + "px";
	document.getElementById('lineY').style.height = document.documentElement.scrollHeight + "px";
	document.getElementById('lineX').style.width = document.documentElement.scrollWidth + "px";
	document.getElementById('lineY').style.left = lineValueX + 5 + "px";
	
	browserToolBarHeight = e.screenY - e.clientY;
	//console.log("browserToolBarHeight:" + browserToolBarHeight);
}
function mouseIframeLineMove(e) {
	e = e || event || window.event;
	var lineValueX = e.screenX;
	var lineValueY = e.screenY - browserToolBarHeight + (document.documentElement.scrollTop || document.body.scrollTop);;

	document.getElementById('lineX').style.top = lineValueY + 5 + "px";
	document.getElementById('lineY').style.height = document.documentElement.scrollHeight + "px";
	document.getElementById('lineX').style.width = document.documentElement.scrollWidth + "px";
	document.getElementById('lineY').style.left = lineValueX + 5 + "px";
}
//---------------------------辅助线功能结束---------------------------//
//---------------------------帮组功能开始---------------------------//

function navToolbarHelp() {
	window.open(BarrierFreeConfig.barrierfreeHelp);
}
//---------------------------帮组功能结束---------------------------//
//---------------------------重置功能开始-----------------------------//

function resetNavToolbar() {
	delCookie("textFlag");
	delCookie("zoomValue");
	delCookie("fontValue");
	delCookie("colorFlag");
	delCookie("lineFlag");
	window.location.href = window.location.href;
	window.location.reload();
}
//---------------------------重置功能结束-----------------------------//
////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////
//工具条监听函数

function toolBarKeyDownEvent(sKeycode, e) {
	if (sKeycode == 74 && e.altKey && !e.shiftKey && !e.ctrlKey) {
		//Alt+J:工具条开关
		toggleToolBar();
	} if (sKeycode == 49 && e.altKey && !e.shiftKey && !e.ctrlKey) {
		//Alt+1:打开帮助
		navToolbarHelp();
	} else if (sKeycode == 74 && e.altKey && e.shiftKey && !e.ctrlKey) {
		//Alt+Shift+J:纯文本开关
		openTextFunction();
	}
}


//----------------------------------------------------------------------
//无障碍快捷键JS
//Version：V0.01
//Author：action
//Date：2011-12-16
//----------------------------------------------------------------------

//键盘键
//大键盘 1
var NumOneKey = '49';
//大键盘 2
var NumTwoKey = '50';
//大键盘 3
var NumThreeKey = '51';
//大键盘 4
var NumFourKey = '52';
//大键盘 5
var NumFiveKey = '53';
//大键盘 6
var NumSixKey = '54';
//字母键 z
var GroupTagKey = '90';

//区域  ID
//无障碍操作说明ID//读屏软件语音接口：已定位到无障碍帮助
//var AccessHelp = BarrierFreeConfig.AccessHelp;//'accesshelp';
var AccessHelpTitle = "已定位到无障碍帮助";

//主导航区ID//读屏软件语音接口：已定位到网站导航
//var MainNavigation = BarrierFreeConfig.MainNavigation;//'nav';
var MainNavigationTitle = "已定位到网站导航";

//var HeaderGuide = BarrierFreeConfig.HeaderGuide;//'headerGuideNav';
var HeaderGuideTitle = "已跳转到网站服务引导区";

//主要内容区ID//读屏软件语音接口：已跳转到主要内容区
//var MainContent = BarrierFreeConfig.MainContent;//'mainbox';
var MainContentTitle = "已跳转到主要内容区";

//网站地图区ID//读屏软件语音接口：已跳转到网站地图
//var SiteMap = BarrierFreeConfig.SiteMap;//'copyright';
var SiteMapTitle = "已跳转到网站地图区";

//搜索区ID//读屏软件语音接口：已跳转到搜索区域
//var SearchForm = BarrierFreeConfig.SearchForm;//'searchbox';
var SearchFormTitle = "已跳转到搜索区域";

//头部内容区ID//读屏软件语音接口：已跳转到头部内容区域
//var HeadContent = BarrierFreeConfig.HeadContent;//'header';
var HeadContentTitle = "已跳转到头部内容区域";

//底部内容区ID//读屏软件语音接口：已跳转到底部内容区域
//var BottomContent = BarrierFreeConfig.BottomContent;//'copyright';
var BottomContentTitle = "已跳转到底部内容区域";

//网页左栏区ID//读屏软件语音接口：已跳转网页左栏区域
//var LeftContent = BarrierFreeConfig.LeftContent;//'leftbox';
var LeftContentTitle = "已跳转网页左栏区域";

//网页中间区ID//读屏软件语音接口：已跳转到中间结构区域
//var MiddleContent = BarrierFreeConfig.MiddleContent;//'leftbox';
var MiddleContentTitle = "已跳转到中间结构区域";

//网页右栏区ID//读屏软件语音接口：已跳转到网页右栏区域
//var RightContent = BarrierFreeConfig.RightContent;//'rightbox';
var RightContentTitle = "已跳转到网页右栏区域";

//栏目分组变量
//栏目分组标记 H2 或 H3 或 H4
var GroupTagNameH2 = 'H2';
var GroupTagNameH3 = 'H3';
var GroupTagNameH4 = 'H4';
//栏目分组计数器初始化为-1
var GroupCount = -1;
//顺（逆）向标记
var ForwardFlag = false;
var BackwardFlag = false;

//快捷键执行函数

function accessKeyboardListener(currkey, e) {
	var browser = browserFlag();
	//浏览器类型判断
	/*--------------------------------------------------------热点跳转开始--------------------------------------------------------*/
	if (String(navigator.platform).indexOf("Win") != -1) {
		//windows操作系统
		if ((e.altKey && !e.shiftKey && !e.ctrlKey) || (!e.altKey && !e.shiftKey && e.ctrlKey)) {
			if (currkey == NumOneKey) {
				//alt+1: 定位到无障碍操作说明连接锚点，
				document.getElementById(BarrierFreeConfig.AccessHelp).focus();
			} else if (currkey == NumTwoKey) {
				//alt+2: 定位到网站导航容器，
				createNodeDiv(BarrierFreeConfig.MainNavigation, BarrierFreeConfig.MainNavigationTitle);
			} else if (currkey == NumThreeKey) {
				//alt+3: 定位到网站服务引导区，
				createNodeDiv(BarrierFreeConfig.HeaderGuide, BarrierFreeConfig.HeaderGuideTitle);
			} else if (currkey == NumFourKey) {
				//alt+4: 定位到主要内容区，
				createNodeDiv(BarrierFreeConfig.MainContent, BarrierFreeConfig.MainContentTitle);
			} else if (currkey == NumFiveKey) {
				//alt+5: 定位到网站地图连接，
				createNodeDiv(BarrierFreeConfig.SiteMap, BarrierFreeConfig.SiteMapTitle);
				//document.getElementById(SiteMap).focus();
			} else if (currkey == NumSixKey) {
				//alt+6: 定位到页面主要搜索框，
				createNodeDiv(BarrierFreeConfig.SearchForm, BarrierFreeConfig.SearchFormTitle);
			}
		}
	} else if (String(navigator.platform).indexOf("Mac") != -1) {
		//Mac操作系统
		if (!e.altKey && !e.shiftKey && e.ctrlKey) {
			if (currkey == NumOneKey) {
				//alt+1: 定位到无障碍操作说明连接锚点，
				document.getElementById(BarrierFreeConfig.AccessHelp).focus();
			} else if (currkey == NumTwoKey) {
				//alt+2: 定位到网站导航容器，
				createNodeDiv(BarrierFreeConfig.MainNavigation, BarrierFreeConfig.MainNavigationTitle);
			} else if (currkey == NumThreeKey) {
				//alt+3: 定位到网站服务引导区，
				createNodeDiv(BarrierFreeConfig.HeaderGuide, BarrierFreeConfig.HeaderGuideTitle);
			} else if (currkey == NumFourKey) {
				//alt+4: 定位到主要内容区，
				createNodeDiv(BarrierFreeConfig.MainContent, BarrierFreeConfig.MainContentTitle);
			} else if (currkey == NumFiveKey) {
				//alt+5: 定位到网站地图连接，
				createNodeDiv(BarrierFreeConfig.SiteMap, BarrierFreeConfig.SiteMapTitle);
				//document.getElementById(SiteMap).focus();
			} else if (currkey == NumSixKey) {
				//alt+6: 定位到页面主要搜索框，
				createNodeDiv(BarrierFreeConfig.SearchForm, BarrierFreeConfig.SearchFormTitle);
			}
		}
	}
	/*--------------------------------------------------------热点跳转结束-------------------------------------------------------*/
	/*------------------------------------------------------分组栏目跳转开始-----------------------------------------------------*/
	if (currkey == GroupTagKey) {
		if ((!e.altKey && !e.shiftKey && e.ctrlKey) || (e.altKey && !e.shiftKey && !e.ctrlKey)) {
			groupSkip(0);
			//分组栏目跳转快捷键：ctrl+Z
		} else if ((!e.altKey && e.shiftKey && e.ctrlKey) || (e.altKey && e.shiftKey && !e.ctrlKey)) {
			groupSkip(1);
			//分组栏目逆向跳转快捷键：ctrl+shift+z
		}
	}
	/*--------------------------------------------------------分组栏目跳转结束----------------------------------------------------*/
	/*----------------------------------------------------------区域跳转开始------------------------------------------------------*/
	if (e.altKey && e.shiftKey && !e.ctrlKey) {
		if (currkey == NumOneKey) {
			//alt+shift+1：跳转到头部，
			createNodeDiv(BarrierFreeConfig.HeadContent, BarrierFreeConfig.HeadContentTitle);
		} else if (currkey == NumTwoKey) {
			//alt+shift+4: 跳转到左栏，
			createNodeDiv(BarrierFreeConfig.LeftContent, BarrierFreeConfig.LeftContentTitle);
		} else if (currkey == NumThreeKey) {
			//alt+shift+3: 跳转到中间区域，
			createNodeDiv(BarrierFreeConfig.MiddleContent, BarrierFreeConfig.MiddleContentTitle);
		} else if (currkey == NumFourKey) {
			//alt+shift+5: 跳转到右栏，
			createNodeDiv(BarrierFreeConfig.RightContent, BarrierFreeConfig.RightContentTitle);
		} else if (currkey == NumFiveKey) {
			//alt+shift+2: 跳转到底部，
			createNodeDiv(BarrierFreeConfig.BottomContent, BarrierFreeConfig.BottomContentTitle);
		}
	}
	/*----------------------------------------------------------区域跳转结束------------------------------------------------------*/
}

//栏目分组跳转

function groupSkip(skipFlag, GroupTagName) {
	var allSkipNode = new Array();
	var j = 0;
	var allNode = document.getElementsByTagName("*");
	for (i = 0; i < allNode.length; i++) {
		var newNodeName = allNode[i].nodeName;
		if (newNodeName == BarrierFreeConfig.GroupTagNameH2 || newNodeName == BarrierFreeConfig.GroupTagNameH3 || newNodeName == BarrierFreeConfig.GroupTagNameH4) {
			allSkipNode[j] = i;
			j++;
		}
	}
	//获取栏目分组跳转标签的个数
	var NumGroupTagID = allSkipNode.length
	if (NumGroupTagID == 0) {
		return;
	}
	//没有栏目分组标签返回
	if (skipFlag == 0) {
		//分组栏目正向跳转
		ForwardFlag = true;
		if (BackwardFlag) {
			BackwardFlag = false;
		}
		this.GroupCount++;
		if (this.GroupCount > NumGroupTagID - 1) {
			this.GroupCount = 0;
		}
	} else if (skipFlag == 1) {
		//分组栏目逆向跳转
		BackwardFlag = true;
		if (ForwardFlag) {
			ForwardFlag = false;
		}
		this.GroupCount--;
		if (this.GroupCount < 0) {
			this.GroupCount = NumGroupTagID - 1;
		}
	}
	var mainDiv = allNode[allSkipNode[GroupCount]];
	var titleText = mainDiv.innerText || mainDiv.textContent;
	var title = titleText + "";
	if (mainDiv.nodeName == BarrierFreeConfig.GroupTagNameH2) {
		title = titleText + "";
	}
	createNode(mainDiv, title);
}

//创建层节点：----------------------------------

function createNodeDiv(divID, title) {
	var mainDiv = document.getElementById(divID);
	//若主目录下无跳转ID，查看Iframe中是否有
	if (!mainDiv) {
		mainDiv = iframeSearch(divID);
		if (!mainDiv) {
			return;
		}
	}
	createNode(mainDiv, title);
}
//在跳转区域第一个子节点前创建----------------

function createNode(mainDiv, title) {
	var newNode = document.createElement("div");
	newNode.style.cssText = "width:0px;height:0px;overflow:hidden;";
	newNode.innerHTML = "<a href=\"javascript:\" title=\"" + title + "\" onblur=\"deleteNodeDiv(this)\">" + title + "</a>";
	mainDiv.parentNode.insertBefore(newNode, mainDiv);
	newNode.firstChild.focus();
}

//删除层节点----------------------------------

function deleteNodeDiv(node) {
	var browser = browserFlag();
	if (browser.ie) {
		node.parentNode.removeNode(true);
	} else {
		node.parentNode.parentNode.removeChild(node.parentNode);
	}
}
//查找Iframe中快捷键ID

function iframeSearch(divID) {
	var iframeNode = document.body.getElementsByTagName("iframe");
	if (!iframeNode) {
		return;
	}
	for (var i = 0; i < iframeNode.length; i++) {
		try {
			var newDivID = iframeNode[i].contentWindow.document.getElementById("divID");
		} catch (e) {}
	}
	return newDivID;
}

//在iframe中增加监听调用父页面监听函数
function addKeyListenerToIframe(iframeObject)
{
	var iframeNode = document.body.getElementsByTagName("iframe");
	if(!iframeNode){return;}	
	for(var i=0;i<iframeNode.length;i++){
		var iframeObject = iframeNode[i].contentWindow;
		bindKeyDownEvent(iframeObject);
	}
}

function bindKeyDownEvent(iframeObject)
{
	try {
		iframeObject.document.onkeydown = KeyDownEvent;
		var iFrameAllNode = iframeObject.document.getElementsByTagName("body")[0].getElementsByTagName("*");
		for (var j = 0; j < iFrameAllNode.length;j++ ) {
			if(iFrameAllNode[j].tagName == 'iframe' || iFrameAllNode[j].tagName=='IFRAME') {
				var innerIframeObject = iFrameAllNode[j].contentWindow;
				bindKeyDownEvent(innerIframeObject);
			}
		}
	} catch (e) {}
}
function KeyDownEvent(e) {
	//快捷键获取
	var currkey = 0,
	e = e || event || window.event;
	currkey = e.keyCode || e.which || e.charCode;
	//快捷键键盘监听
	top.accessKeyboardListener(currkey, e);
	//工具条键盘监听
	top.toolBarKeyDownEvent(currkey, e);
}
// 全局对象
var INSTANCE = new Object();
//定义主内容盒子
var mainBoxID;

initBarrierFree();

$(function() {
	var pathname = window.location.pathname;
	var path;
	if (!Array.prototype.indexOf)
	{
	  Array.prototype.indexOf = function(elt /*, from*/)
	  {
	    var len = this.length >>> 0;
	    var from = Number(arguments[1]) || 0;
	    from = (from < 0)
	         ? Math.ceil(from)
	         : Math.floor(from);
	    if (from < 0)
	      from += len;
	    for (; from < len; from++)
	    {
	      if (from in this &&
	          this[from] === elt)
	        return from;
	    }
	    return -1;
	  };
	}
	if(pathname.indexOf("/view/")!=-1){
		path = pathname.substr(0,pathname.indexOf("/web")) + "../../ui/js/barrierfree.config.js";
//		if(pathname.indexOf("col")!=-1){
//			path = "../../../module/accessiblereading/js/barrierfree.config.js";
//		}else if(pathname.indexOf("art")!=-1){
//			path = "../../../../../module/accessiblereading/js/barrierfree.config.js";
//		}else{
//			path = "../module/accessiblereading/js/barrierfree.config.js";
//		}
	}else{
		path = "../../ui/js/barrierfree.config.js";
//		if(pathname.indexOf("col")!=-1){
//			path = "../../module/accessiblereading/js/barrierfree.config.js";
//		}else if(pathname.indexOf("art")!=-1){
//			path = "../../../../module/accessiblereading/js/barrierfree.config.js";
//		}else{
//			path = "module/accessiblereading/js/barrierfree.config.js";
//		}
	}
	$.getScript(path);
});











///*20160614*/纯文本功能实现

function textFunction() {
		$("#shixianlist").remove();$("#shengjilist").remove();

	//navgationIframe();
	changeiFrame();
	changeImage();
	changeStyle();

	var hrefLinks = $('a:not(:empty)');
	var validLinks = new Array();
	hrefLinks.each(function() {
		var itemLink = $(this);
		var linkText = itemLink.text();
		if ($.trim(linkText).length > 2) {
			validLinks.push(itemLink[0]);
		}
	});
	$('#barrierfree_container').html(validLinks);
	$('#barrierfree_container').append("<link type='text/css' rel='stylesheet' href='../ui/css/barrierfree.css'>");
	
}
